[
  {
    "id": "a",
    "title": "Domaine de compétences opérationnelles a",
    "subject": "Suivi des projets ICT",
    "competences": [
      {
        "id": "a1",
        "title": "Compétence opérationnelle a1",
        "subject": "Clarifier et documenter les besoins des parties prenantes dans le cadre d’un projet ICT",
        "description": "_Les informaticiens et informaticiennes recueillent les objectifs du projet et les besoins des parties prenantes et les documentent:_\n\nIls s’enquièrent tout d’abord des objectifs du projet et en clarifient les paramètres généraux tels que coûts, durée, qualité, périmètre, responsabilités et méthodologie (séance initiale pour établir une feuille de route). Pour ce faire, ils appliquent diverses techniques d’audition et d’observation (p. ex. questions ouvertes, questions fermées, réunion, workshop, technique du shadowing, simulation de la solution à rechercher en opérant un saut dans le temps). Grâce à leur empathie, ils sont en mesure de saisir au mieux les besoins des parties prenantes/de la clientèle et de conduire l’entretien de manière ciblée. Puis, ils analysent le contexte du système: quelles exigences le système à développer doit-il remplir? Ils clarifient la délimitation du système et du contexte et identifient les interfaces. Ils élaborent des solutions pour prévenir les éventuels conflits d’objectifs. (Elucidation des exigences)\n\nEnsuite, ils transposent la définition exprimée dans le langage naturel (des parties prenantes) dans une documentation modélisée et classent les objectifs et exigences du projet (p. ex. modèle de Kano). Ils veillent à limiter les marges d’interprétation. Le but est de disposer d’objectifs et d’exigences de projet clairs, non ambigus et référençables servant de base à la suite du processus d’ingénierie. (Documentation / Communication des exigences)\n\nAu terme de ces étapes, ils vérifient les objectifs et exigences de projet définis quant à leur mesurabilité, cohérence, exhaustivité, nécessité, exactitude et référençabilité. A cet effet, ils utilisent des techniques de soutien (p. ex. inspection, walkthrough, lecture basée sur les perspectives, vérification par prototypage). (Validation des exigences)\n\nEnfin, ils définissent les caractéristiques de traitement des exigences et objectifs de projet individuels (p. ex. gestion des versions, identificateur de référençabilité, description, auteur, source, criticité, priorité). (Gestion des exigences)",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a1.1",
            "descr": "Ils clarifient les objectifs du projet ICT et ses paramètres généraux tels que coûts, durée, qualité, périmètre, responsabilités et méthodologie.",
            "bloom": "C3"
          },
          {
            "id": "a1.2",
            "descr": "Ils appliquent diverses techniques d’audition et d’observation (p. ex. questions ouvertes, questions fermées, réunion, workshop, technique du shadowing, simulation de la solution à rechercher en opérant un saut dans le temps.",
            "bloom": "C5"
          },
          {
            "id": "a1.3",
            "descr": "Ils analysent le contexte du système, procèdent à une délimitation du système et du contexte et identifient les interfaces.",
            "bloom": "C4"
          },
          {
            "id": "a1.4",
            "descr": "Ils élaborent des solutions pour prévenir les éventuels conflits d’objectifs.",
            "bloom": "C5"
          },
          {
            "id": "a1.5",
            "descr": "Ils transposent la définition exprimée dans le langage naturel (des parties prenantes) dans une documentation modélisée contenant des objectifs et des exigences de projet clairs, non ambigus et référençables.",
            "bloom": "C5"
          },
          {
            "id": "a1.6",
            "descr": "Ils vérifient les objectifs et exigences de projet définis quant à leur mesurabilité, cohérence, exhaustivité, nécessité, exactitude et référençabilité.",
            "bloom": "C4"
          },
          {
            "id": "a1.7",
            "descr": "Ils définissent les caractéristiques de traitement des exigences et objectifs de projet individuels (p. ex. gestion des versions, identificateur de référençabilité, description, auteur, source, criticité, priorité).",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ]
      },
      {
        "id": "a2",
        "title": "Compétence opérationnelle a2",
        "subject": "Définir un modèle de procédure pour un projet ICT",
        "description": "_Les informaticiens et informaticiennes choisissent un modèle de procédure adapté aux objectifs et aux exigences du projet:_\n\nIls analysent tout d’abord les paramètres obtenus sous la compétence opérationnelle a1 et les conditions données par le mandant (p. ex. structure de l’équipe, dynamique des exigences, culture de développement, taille de l’équipe).\n\nEnsuite, ils pèsent les avantages et inconvénients de divers modèles de procédure planifiés ou agiles (itératifs, incrémentaux) en relation avec le projet ICT, les évaluent et sélectionnent le modèle approprié. Si nécessaire, ils adaptent le modèle aux spécificités du projet (process tailoring).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a2.1",
            "descr": "Ils analysent les paramètres et les conditions données par le mandant.",
            "bloom": "C4"
          },
          {
            "id": "a2.2",
            "descr": "Ils pèsent les avantages et inconvénients de divers modèles de procédure planifiés ou agiles (itératifs, incrémentaux) en relation avec le projet ICT et sélectionnent le modèle approprié.",
            "bloom": "C4"
          },
          {
            "id": "a2.3",
            "descr": "Ils adaptent le modèle de procédure aux spécificités du projet (process tailoring).",
            "bloom": "C5"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ]
      },
      {
        "id": "a3",
        "title": "Compétence opérationnelle a3",
        "subject": "Rechercher des informations sur des solutions ICT et sur les innovations",
        "description": "_Les informaticiens et informaticiennes recherchent de façon ciblée des informations sur des solutions ICT en vue de combler les lacunes en matière de connaissances ou de faire le point sur l’état de la technique:_\n\nIls recherchent des innovations, p. ex. pour établir une vue d’ensemble de la situation du marché ou déterminer l’état actuel de la technique. A cet effet, ils consultent de façon ciblée et systématique des informations issues de sources numériques et analogiques. Ils examinent les résultats d’un œil critique et identifient les sources fiables et non fiables ou peu sérieuses.\n\nDes résultats obtenus, ils dégagent plusieurs variantes, les comparent et les évaluent. Ce faisant, ils montrent le potentiel technique et les risques des différentes variantes.\n\nPour la variante privilégiée, ils établissent une preuve de concept technique (proof of concept [PoC]) afin de démontrer la faisabilité fondamentale d’un projet (p. ex. pour réduire les risques).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a3.1",
            "descr": "Ils cherchent de façon ciblée et systématique des informations de sources numériques et analogiques.",
            "bloom": "C4"
          },
          {
            "id": "a3.2",
            "descr": "Ils identifient les sources fiables.",
            "bloom": "C4"
          },
          {
            "id": "a3.3",
            "descr": "Ils comparent plusieurs variantes issues des résultats obtenus et les évaluent.",
            "bloom": "C4"
          },
          {
            "id": "a3.4",
            "descr": "Ils montrent le potentiel technique des variantes et leurs risques.",
            "bloom": "C4"
          },
          {
            "id": "a3.5",
            "descr": "Ils établissent une preuve de concept technique (PoC).",
            "bloom": "C5"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "241",
            "descr": "Initialiser des solutions ICT innovantes"
          },
          {
            "id": "245",
            "descr": "Mettre en œuvre des solutions ICT innovantes"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "248",
            "descr": "Réaliser des solutions ICT avec des technologies actuelles (module optionnel)"
          }
        ]
      },
      {
        "id": "a4",
        "title": "Compétence opérationnelle a4",
        "subject": "Planifier les projets ICT et les tâches selon un modèle de procédure",
        "description": "_Les informaticiens et informaticiennes planifient les tâches selon le modèle de procédure choisi:_\n\nIndépendamment du modèle de procédure, ils découpent une tâche globale en activités plus restreintes, plus facilement évaluables et attribuables à une ressource (de l’ensemble au détail). Ils différencient les activités en fonction de la charge et de la durée de travail, établissent une estimation temporelle et évaluent le degré de complexité de la tâche.\n\nIls clarifient ensuite les dépendances séquentielles des activités, en définissent l’ordre chronologique et, éventuellement, les ressources nécessaires.\n\nEnfin, ils regroupent et priorisent les activités nécessaires à la réalisation d’un objectif intermédiaire sur la base de directives temporelles ou fonctionnelles et consignent le tout.\n\nCi-après, le déroulement des tâches expliqué simplement à partir de l’exemple du scrum, tous rôles confondus:\n\n\n   - ils définissent et priorisent (p. ex. valeur business [BV], retour sur investissement [ROI]) les user stories dans le product backlog avec les parties prenantes;\n\n   - ils définissent la vitesse et les objectifs (conditions de satisfaction) pour l’itération planifiée (sprint);\n\n   - ils évaluent (story points) les user stories (story poker) et\n\n   - ils définissent le sprint backlog.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a4.1",
            "descr": "Ils découpent une tâche globale en activités plus restreintes, plus facilement évaluables et attribuables à une ressource.",
            "bloom": "C3"
          },
          {
            "id": "a4.2",
            "descr": "Ils identifient les activités selon la charge et la durée de travail.",
            "bloom": "C4"
          },
          {
            "id": "a4.3",
            "descr": "Ils évaluent la charge, la durée et le degré de complexité des activités.",
            "bloom": "C4"
          },
          {
            "id": "a4.4",
            "descr": "Ils clarifient les dépendances séquentielles des activités et en définissent l’ordre chronologique.",
            "bloom": "C4"
          },
          {
            "id": "a4.5",
            "descr": "Ils regroupent et priorisent les activités nécessaires à la réalisation d’un objectif intermédiaire sur la base de directives temporelles ou fonctionnelles.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ]
      },
      {
        "id": "a5",
        "title": "Compétence opérationnelle a5",
        "subject": "Visualiser et présenter les variantes de solutions ICT",
        "description": "_Les informaticiens et informaticiennes procèdent à la visualisation des variantes de solutions ICT et les présentent:_\n\nIls identifient tout d’abord le groupe cible et ses besoins en informations sur les solutions ICT selon le catalogue des exigences.\n\nSur cette base, ils identifient les caractéristiques des solutions ICT qui sont propres au groupe cible. Ils regroupent les constats tirés de ces caractéristiques sous une forme visuelle adaptée au groupe cible et au problème (p. ex. tableau à feuilles, tableau blanc, programme de présentation, vidéoconférence). A cet effet, ils utilisent leur créativité et leur faculté d’abstraction.\n\nEnfin, ils présentent leurs propositions de solution de façon probante et convaincante pour aider les décideurs dans leur prise de décision (p. ex. technique du storytelling).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a5.1",
            "descr": "Ils identifient le groupe cible et ses besoins en informations sur une solution ICT selon un catalogue des exigences.",
            "bloom": "C4"
          },
          {
            "id": "a5.2",
            "descr": "Ils identifient les caractéristiques des solutions ICT qui sont propres au groupe cible.",
            "bloom": "C4"
          },
          {
            "id": "a5.3",
            "descr": "Ils regroupent les constats tirés de ces caractéristiques sous une forme visuelle adaptée au groupe cible et au problème (p. ex. tableau à feuilles, tableau blanc, programme de présentation, vidéoconférence.",
            "bloom": "C5"
          },
          {
            "id": "a5.4",
            "descr": "Ils présentent leurs propositions de solution de façon probante et convaincante (p. ex. storytelling).",
            "bloom": "C5"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ]
      },
      {
        "id": "a6",
        "title": "Compétence opérationnelle a6",
        "subject": "Vérifier l’avancement des projets ICT et des tâches et en faire état selon le modèle de procédure",
        "description": "_Les informaticiens et informaticiennes suivent régulièrement l’état d’avancement du projet et des tâches assignées et en font état selon le modèle de procédure spécifique au projet:_\n\nSelon leur rôle, ils demandent ou fournissent une évaluation sur l’état d’avancement des mandats assignés (personnellement ou au moyen d’un outil).\n\nS’ils ont un rôle de coordination ou de conduite de projet, ils procèdent aux étapes suivantes:\n\nIls recueillent les évaluations, les catégorisent et les priorisent. Ils consolident ensuite les évaluations et élaborent, si nécessaire, des propositions de mesures correctives. Dans une autre étape, ils consignent l’état d’avancement du projet, le présentent sous forme visuelle et le communiquent. Enfin, ils définissent, conjointement avec les décideurs, la suite de la procédure, p. ex. prise de décision quant aux mesures correctives.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a6.1",
            "descr": "Ils établissent une évaluation sur l’état d’avancement des mandats assignés (personnellement ou au moyen d’un outil).",
            "bloom": "C3"
          },
          {
            "id": "a6.2",
            "descr": "Ils catégorisent et priorisent les évaluations recueillies.",
            "bloom": "C4"
          },
          {
            "id": "a6.3",
            "descr": "Ils consolident les évaluations et élaborent, si nécessaire, des propositions de mesures correctives.",
            "bloom": "C5"
          },
          {
            "id": "a6.4",
            "descr": "Ils consignent l’état d’avancement du projet et le présentent sous forme visuelle.",
            "bloom": "C3"
          },
          {
            "id": "a6.5",
            "descr": "Ils font état, sous forme résumée, des résultats relatifs à l’avancement du projet selon le modèle de procédure spécifique au projet.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ]
      },
      {
        "id": "a7",
        "title": "Compétence opérationnelle a7",
        "subject": "Remettre la solution ICT au client et clôturer le projet",
        "description": "_Les informaticiens et informaticiennes remettent la solution ICT au client et clôturent le projet selon les dispositions convenues dans le mandat de projet:_\n\nIls identifient tout d’abord auprès du client les personnes à impliquer dans cette étape. Si rien n’a été prévu, ils définissent conjointement avec le client les critères et la procédure de réception ainsi que la chronologie de la remise.\n\nIls mettent ensuite à disposition la documentation convenue dans le mandat de projet. Si nécessaire, ils planifient une formation/instruction et préparent les supports correspondants.\n\nPuis, ils procèdent à la réception du projet par le client selon les critères définis et établissent un procès-verbal de réception.\n\nEnfin, ils archivent et sauvegardent leur travail selon les directives spécifiques à l’entreprise.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "a7.1",
            "descr": "Ils identifient auprès du mandant les personnes à impliquer.",
            "bloom": "C3"
          },
          {
            "id": "a7.2",
            "descr": "Ils définissent conjointement avec le mandant les critères et la procédure de réception ainsi que la chronologie de la remise.",
            "bloom": "C3"
          },
          {
            "id": "a7.3",
            "descr": "Ils mettent à disposition la documentation convenue dans le mandat de projet.",
            "bloom": "C3"
          },
          {
            "id": "a7.4",
            "descr": "Ils planifient une formation/instruction.",
            "bloom": "C3"
          },
          {
            "id": "a7.5",
            "descr": "Ils préparent les supports de formation.",
            "bloom": "C5"
          },
          {
            "id": "a7.6",
            "descr": "Ils procèdent à la réception du projet par le mandant selon les critères définis et établissent un procès-verbal de réception.",
            "bloom": "C3"
          },
          {
            "id": "a7.7",
            "descr": "Ils archivent et sauvegardent leur travail selon les directives spécifiques à l’entreprise.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ]
      }
    ]
  },
  {
    "id": "b",
    "title": "Domaine de compétences opérationnelles b",
    "subject": "Assistance et conseils dans l’environnement ICT",
    "competences": [
      {
        "id": "b1",
        "title": "Compétence opérationnelle b1",
        "subject": "Installer un PC monoposte",
        "description": "_Les informaticiens et informaticiennes installent leur Poste de travail ICT avec tous les composants nécessaires:_\n\nIls équipent tout d’abord leur ordinateur d’un système d’exploitation, le relient au réseau et testent la connexion. Ils configurent les mesures de sécurité requises (pare-feu, systèmes antivirus, etc.) selon les directives de l’entreprise.\n\nSi nécessaire, ils installent les logiciels, testent leur bon fonctionnement et effectuent éventuellement des mises à jour.\n\nIls relient ensuite leur ordinateur aux autres périphériques et testent leur fonctionnement.\n\nIls installent et règlent ensuite leurs bureau et chaise conformément aux principes ergonomiques.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "b1.1",
            "descr": "Ils équipent leur ordinateur d’un système d’exploitation.",
            "bloom": "C3"
          },
          {
            "id": "b1.2",
            "descr": "Ils relient leur ordinateur au réseau et testent la connexion.",
            "bloom": "C3"
          },
          {
            "id": "b1.3",
            "descr": "Ils configurent les mesures de sécurité requises (pare-feu, systèmes antivirus, etc.) selon les directives de l’entreprise. ",
            "bloom": "C3"
          },
          {
            "id": "b1.4",
            "descr": "Ils installent les logiciels, les testent et effectuent, si nécessaire, les mises à jour.",
            "bloom": "C3"
          },
          {
            "id": "b1.5",
            "descr": "Ils relient leur ordinateur aux autres périphériques et testent leur fonctionnement.",
            "bloom": "C3"
          },
          {
            "id": "b1.6",
            "descr": "Ils installent et règlent leurs bureau et chaise conformément aux principes ergonomiques.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "114",
            "descr": "Mettre en œuvre des systèmes de codification, de compression et d’encryptage"
          },
          {
            "id": "117",
            "descr": "Mettre en place l’infrastructure informatique et réseau d’une petite entreprise"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "187",
            "descr": "Mettre en service un poste de travail ICT avec le système d’exploitation"
          }
        ]
      },
      {
        "id": "b2",
        "title": "Compétence opérationnelle b2",
        "subject": "Réceptionner et traiter des demandes d’assistance informatique complexes",
        "description": "_Les informaticiens et informaticiennes réceptionnent des demandes d’assistance informatique complexes et élaborent des solutions:_\n\nDans le cadre de l’assistance de 3 e niveau, ils reçoivent une demande d’assistance pour un problème informatique complexe. Ils réceptionnent la demande et commencent par analyser immédiatement et de façon systématique son contenu (p. ex. à l’aide d’un catalogue de questions ou d’une check-list).\n\nAu moyen de méthodes adéquates ou dans le cadre de collaborations, ils élaborent une solution et la documentent selon les directives spécifiques à l’entreprise. Ils préparent la solution conformément au groupe cible (p. ex. pour l’assistance de 2 e niveau) et la communiquent à l’auteur de la demande.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "b2.1",
            "descr": "Ils analysent des demandes d’assistance complexes de façon systématique (p. ex. à l’aide d’un catalogue de questions ou d’une check-list).",
            "bloom": "C4"
          },
          {
            "id": "b2.2",
            "descr": "Au moyen de méthodes adéquates ou dans le cadre de collaborations, ils élaborent des solutions.",
            "bloom": "C5"
          },
          {
            "id": "b2.3",
            "descr": "Ils documentent les solutions selon les directives spécifiques à l’entreprise.",
            "bloom": "C3"
          },
          {
            "id": "b2.4",
            "descr": "Ils préparent les solutions conformément au groupe cible (p. ex. pour l’assistance de 2e niveau) et les communiquent.",
            "bloom": "C3"
          }
        ]
      },
      {
        "id": "b3",
        "title": "Compétence opérationnelle b3",
        "subject": "Conseiller les clients en matière de protection et de sécurité des données",
        "description": "_Les informaticiens et informaticiennes conseillent les clients sur la manière de traiter les données sensibles et proposent des solutions pour la mise en place de mesures de protection:_\n\nPour ce faire, ils clarifient la situation en matière de sécurité auprès du mandant en posant des questions ciblées sur les systèmes, réseaux, logiciels et données. Sur la base des informations obtenues, ils proposent les mesures de protection nécessaires et recommandées pour les domaines examinés. Ils créent une prise de conscience chez le mandant en ce qui concerne les dangers liés au réseau et au traitement des données sensibles.\n\nPour remplir ces tâches, ils s’informent en continu sur les modifications apportées au cadre juridique/aux prescriptions légales applicables en l’espèce.\n\nSi nécessaire, ils forment les collaborateurs dans l’application des directives informatiques propres à l’entreprise.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "b3.1",
            "descr": "Ils clarifient la situation en matière de sécurité auprès du mandant en posant des questions ciblées sur les systèmes, réseaux, logiciels et données.",
            "bloom": "C4"
          },
          {
            "id": "b3.2",
            "descr": "Ils informent le mandant sur les dangers liés au réseau et au traitement des données sensibles.",
            "bloom": "C3"
          },
          {
            "id": "b3.3",
            "descr": "Ils proposent les mesures de protection nécessaires et recommandées pour les domaines examinés.",
            "bloom": "C5"
          },
          {
            "id": "b3.4",
            "descr": "Ils forment les collaborateurs dans l’application des directives informatiques propres à l’entreprise.",
            "bloom": "C5"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "231",
            "descr": "Appliquer la protection et la sécurité des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "185",
            "descr": "Analyser et implémenter des mesures visant à assurer la sécurité informatique des PME (module optionnel)"
          },
          {
            "id": "107",
            "descr": "Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)"
          }
        ]
      },
      {
        "id": "b4",
        "title": "Compétence opérationnelle b4",
        "subject": "Analyser, visualiser et documenter les processus métier des clients",
        "description": "_Les informaticiens et informaticiennes analysent les processus métier, les représentent sous forme graphique et les documentent:_\n\nLors de la première étape, ils identifient les informations déterminantes sur les processus (intitulé du processus, événement déclencheur, résultat, déclencheur, destinataire). Ils découpent, dans le cadre d’une analyse des tâches, les processus métier en étapes individuelles. Ils documentent le déroulement du processus et le représentent graphiquement selon les standards de description reconnus et usuels.\n\nDans une deuxième étape, ils précisent le déroulement du processus avec des informations complémentaires telles que les outils requis, les exécutants et la description du résultat (output).\n\nEnfin, ils transmettent la documentation au client.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "b4.1",
            "descr": "Ils identifient les informations déterminantes sur les processus (intitulé, événement déclencheur, résultat, déclencheur, destinataire).",
            "bloom": "C4"
          },
          {
            "id": "b4.2",
            "descr": "Ils découpent, dans le cadre d’une analyse des tâches, les processus métier en étapes individuelles.",
            "bloom": "C4"
          },
          {
            "id": "b4.3",
            "descr": "Ils documentent le déroulement du processus et le représentent graphiquement selon les standards de description reconnus et usuels.",
            "bloom": "C3"
          },
          {
            "id": "b4.4",
            "descr": "Ils précisent le déroulement du processus avec des informations complémentaires telles que les outils requis, les exécutants et la description du résultat (output).",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "254",
            "descr": "Décrire des processus métier dans son propre environnement professionnel"
          }
        ]
      }
    ]
  },
  {
    "id": "c",
    "title": "Domaine de compétences opérationnelles c",
    "subject": "Création et maintenance de données numériques",
    "competences": [
      {
        "id": "c1",
        "title": "Compétence opérationnelle c1",
        "subject": "Identifier et analyser les données et développer des modèles de données",
        "description": "_Les informaticiens et informaticiennes analysent des données issues de diverses sources de données et les regroupent dans un modèle de données adéquat:_\n\nSelon le mandat, ils reçoivent des données issues de diverses sources de données structurées ou non structurées. Ils examinent tout d’abord les données avant de les classer selon le modèle 4V (volume, variété, vitesse, véracité). Ensuite, ils analysent les données quant à leur précision, à leur concision et à leur incohérence et les nettoient si nécessaire.\n\nDans une autre étape, ils recueillent, à partir des formes d’analyse existantes (rapports), des indicateurs/points de repère pour la création du modèle.\n\nIls définissent, selon le type de données, des cas de test appropriés pour l’exactitude des données ainsi qu’une structure adéquate pour les données nettoyées.\n\nEnfin, ils normalisent le modèle de données et le représentent sous une forme appropriée.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "c1.1",
            "descr": "Ils examinent les données issues de sources de données structurées ou non structurées avant de les classer selon le modèle 4V.",
            "bloom": "C4"
          },
          {
            "id": "c1.2",
            "descr": "Ils analysent les données quant à leur précision, à leur concision et à leur incohérence et les nettoient si nécessaire.",
            "bloom": "C4"
          },
          {
            "id": "c1.3",
            "descr": "ls recueillent, à partir des formes d’analyse existantes (rapports), des indicateurs/points de repère pour la création du modèle.",
            "bloom": "C4"
          },
          {
            "id": "c1.4",
            "descr": "Ils définissent, selon le type de donnée, des cas de test appropriés pour l’exactitude des données.",
            "bloom": "C3"
          },
          {
            "id": "c1.5",
            "descr": "Ils définissent une structure adéquate pour les données nettoyées.",
            "bloom": "C4"
          },
          {
            "id": "c1.6",
            "descr": "Ils normalisent le modèle de données.",
            "bloom": "C3"
          },
          {
            "id": "c1.7",
            "descr": "Ils représentent le modèle sous une forme appropriée.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "162",
            "descr": "Analyser et modéliser des données"
          },
          {
            "id": "164",
            "descr": "Créer des bases de données et y insérer des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "110",
            "descr": "Analyser et représenter des données avec des outils (module optionnel)"
          },
          {
            "id": "259",
            "descr": "Développer des solutions ICT avec le Machine Learning (module optionnel)"
          }
        ]
      },
      {
        "id": "c2",
        "title": "Compétence opérationnelle c2",
        "subject": "Mettre en œuvre des modèles de données dans un dispositif de stockage de données numériques",
        "description": "_Les informaticiens et informaticiennes réalisent un modèle de données dans un dispositif de stockage de données numériques approprié:_\n\nIls choisissent tout d’abord le dispositif de stockage adéquat (p. ex. objet-relationnel, relationnel, distribué/centralisé). Ils implémentent ensuite le modèle de données normalisé pour le stockage en tenant compte de l’intégrité référentielle.\n\nPuis, ils planifient les tests de fonction et de performance et préparent à cet effet les données de test requises. Ils exécutent les tests de fonction et de performance et les évaluent.\n\nEnfin, ils planifient, à partir de divers systèmes source, les migrations de données vers un système cible et les exécutent. Ils vérifient l’exhaustivité, l’intégrité et l’exactitude des données migrées vers le système cible.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "c2.1",
            "descr": "Ils choisissent un dispositif de stockage de données numériques approprié (p. ex. objet-relationnel, relationnel, distribué/centralisé).",
            "bloom": "C3"
          },
          {
            "id": "c2.2",
            "descr": "Ils implémentent le modèle de données normalisé pour le stockage en tenant compte de l’intégrité référentielle.",
            "bloom": "C3"
          },
          {
            "id": "c2.3",
            "descr": "Ils planifient les tests de fonction et de performance et préparent les données de test requises.",
            "bloom": "C3"
          },
          {
            "id": "c2.4",
            "descr": "Ils exécutent les tests de fonction et de performance.",
            "bloom": "C5"
          },
          {
            "id": "c2.5",
            "descr": "Ils évaluent les tests de fonction et de performance.",
            "bloom": "C4"
          },
          {
            "id": "c2.6",
            "descr": "Ils planifient, à partir de divers systèmes source, les migrations de données vers un système cible et les exécutent.",
            "bloom": "C5"
          },
          {
            "id": "c2.7",
            "descr": "Ils vérifient l’exhaustivité, l’intégrité et l’exactitude des données migrées vers le système cible.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "164",
            "descr": "Créer des bases de données et y insérer des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "106",
            "descr": "Interroger, traiter et assurer la maintenance des bases de données"
          }
        ]
      },
      {
        "id": "c3",
        "title": "Compétence opérationnelle c3",
        "subject": "Planifier, implémenter et documenter la sécurité et la protection des données pour des solutions ICT",
        "description": "_Les informaticiens et informaticiennes planifient des mesures relatives à la sécurité et à la protection des données, les implémentent et les documentent:_\n\nIls identifient tout d’abord les données sensibles et les catégorisent. Ils modélisent ensuite les données sensibles selon le principe de Privacy by design. Ils clarifient les mécanismes de protection nécessaires selon la sensibilité des données et les qualifient. Dans ce contexte, ils tiennent compte du cadre légal (RGBD entre autres) et l’appliquent en fonction de la situation.\n\nSur cette base, ils élaborent un concept de sécurité des données et des rôles conformément au mandat, le documentent et le mettent en œuvre (p. ex. créer une sauvegarde, implémenter les autorisations d’accès, chiffrer les données).\n\nEnfin, ils vérifient l’efficacité des mécanismes de sécurité et de protection installés.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "c3.1",
            "descr": "Ils identifient les données sensibles et les catégorisent.",
            "bloom": "C4"
          },
          {
            "id": "c3.2",
            "descr": "Ils modélisent les données sensibles selon le principe de _Privacy by design_.",
            "bloom": "C3"
          },
          {
            "id": "c3.3",
            "descr": "Ils clarifient les mécanismes de protection nécessaires selon la sensibilité des données et les qualifient.",
            "bloom": "C4"
          },
          {
            "id": "c3.4",
            "descr": "Ils élaborent un concept de sécurité des données et des rôles conformément au mandat.",
            "bloom": "C3"
          },
          {
            "id": "c3.5",
            "descr": "Ils créent une sauvegarde et vérifient si la restauration est réussie.",
            "bloom": "C3"
          },
          {
            "id": "c3.6",
            "descr": "Ils implémentent les autorisations d’accès selon le concept.",
            "bloom": "C3"
          },
          {
            "id": "c3.7",
            "descr": "Ils chiffrent les données selon le concept.",
            "bloom": "C3"
          },
          {
            "id": "c3.8",
            "descr": "Ils vérifient l’efficacité des mécanismes de sécurité et de protection installés.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "231",
            "descr": "Appliquer la protection et la sécurité des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "106",
            "descr": "Interroger, traiter et assurer la maintenance des bases de données"
          },
          {
            "id": "285",
            "descr": "Analyser et implémenter des mesures visant à assurer la sécurité informatique des PME (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          },
          {
            "id": "259",
            "descr": "Développer des solutions ICT avec le Machine Learning (module optionnel)"
          },
          {
            "id": "107",
            "descr": "Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)"
          }
        ]
      },
      {
        "id": "c4",
        "title": "Compétence opérationnelle c4",
        "subject": "Traiter des données à partir de dispositifs de stockage de données numériques",
        "description": "_Les informaticiens et informaticiennes analysent les données à partir de dispositifs de stockage de données numériques et les traitent:_\n\nIls importent tout d’abord les données dans un logiciel d’analyse approprié. Ils procèdent ensuite à une analyse exploratoire des données et identifient les éventuelles erreurs de données. Ils vérifient la validité des données traitées par échantillonnage.\n\nIls comparent ensuite les méthodes de traitement et les formes de représentation établies et les évaluent. Sur cette base, ils choisissent des formes de représentation adaptées et les appliquent (p. ex. «logarithmer» et ne pas représenter de façon linéaire des dépendances non linéaires).\n\nEnfin, ils mettent les données à disposition sous forme anonymisée (p. ex. pour des cas de test).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "c4.1",
            "descr": "Ils importent les données dans un logiciel d’analyse approprié.",
            "bloom": "C3"
          },
          {
            "id": "c4.2",
            "descr": "Ils procèdent à une analyse exploratoire des données et identifient les éventuelles erreurs de données.",
            "bloom": "C4"
          },
          {
            "id": "c4.3",
            "descr": "Ils comparent les méthodes de traitement et les formes de représentation établies et les évaluent.",
            "bloom": "C4"
          },
          {
            "id": "c4.4",
            "descr": "Ils choisissent des formes de représentation adaptées et les appliquent.",
            "bloom": "C3"
          },
          {
            "id": "c4.5",
            "descr": "Ils vérifient la validité des données traitées par échantillonnage.",
            "bloom": "C3"
          },
          {
            "id": "c4.6",
            "descr": "Ils mettent les données à disposition sous forme anonymisée.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "162",
            "descr": "Analyser et modéliser des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "259",
            "descr": "Développer des solutions ICT avec le Machine Learning (module optionnel)"
          },
          {
            "id": "110",
            "descr": "Analyser et représenter des données avec des outils (module optionnel)"
          }
        ]
      }
    ]
  },
  {
    "id": "d",
    "title": "Domaine de compétences opérationnelles d",
    "subject": "Fourniture et exploitation de solutions ICT",
    "competences": [
      {
        "id": "d1",
        "title": "Compétence opérationnelle d1",
        "subject": "Fourniture et exploitation de solutions ICT",
        "description": "_Les informaticiennes et informaticiens recueillent les processus ICT (p. ex. gestion des utilisateurs, provisionnement de services, analyses des journaux), les standardisent et les automatisent. Ils améliorent ainsi l’efficience et la qualité des processus ICT implémentés:_\n\nIls recueillent tout d’abord les besoins des parties prenantes en termes de processus métier et/ou processus spécifiques à l’entreprise. Cette étape peut s’effectuer dans le cadre d’un entretien de conseil (a1). Des besoins identifiés, ils déduisent une proposition de solution technique et la consignent en tenant plus particulièrement compte des spécificités de l’entreprise concernée ainsi que des normes et standards (p. ex. BPMN, outils d’orchestration, outils de planification, OS builds).\n\nIls mettent ensuite la solution en œuvre. Ils exécutent progressivement l’automatisation des processus définis. A cet effet, ils utilisent des langages de script, l’infrastructure en tant que code (IaC) et/ou des cadres d’automatisation (framework automation). Ils se conforment aux procédures recommandées en appliquant les meilleures pratiques.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "d1.1",
            "descr": "Ils recueillent les besoins des clients en matière de processus ICT sous forme d’exigences techniques en les formulant de façon compréhensible et sans tenir compte de la solution. ",
            "bloom": "C4"
          },
          {
            "id": "d1.2",
            "descr": "Des besoins identifiés, ils déduisent une proposition de solution technique et la consignent de façon claire.",
            "bloom": "C4"
          },
          {
            "id": "d1.3",
            "descr": "Ils automatisent les processus ICT définis au moyen de langages de script, de l’infrastructure en tant que code (IaC) et/ou de frameworks d’automatisation.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "122",
            "descr": "Automatiser des procédures à l’aide de scripts"
          },
          {
            "id": "158",
            "descr": "Planifier et exécuter la migration de logiciels"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          },
          {
            "id": "319",
            "descr": "Concevoir et implémenter des applications"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "188",
            "descr": "Exploiter, surveiller et assurer la maintenance des services"
          },
          {
            "id": "223",
            "descr": "Réaliser des applications multi-utilisateurs orientées objets (module optionnel)"
          },
          {
            "id": "335",
            "descr": "Réaliser une application pour mobile (module optionnel)"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "d2",
        "title": "Compétence opérationnelle d2",
        "subject": "Définir le processus de livraison des solutions ICT",
        "description": "_Les informaticiennes et informaticiens définissent le processus de livraison avec lequel les solutions ICT développées seront remises au client. Ils garantissent ainsi une livraison de la solution ICT professionnelle et conforme aux exigences._\n\nIls identifient tout d’abord les processus de livraison existants (p. ex. déploiement logiciel et matériel) en tenant compte des interfaces et des parties prenantes concernées. Ils déterminent la plateforme appropriée et/ou les extensions et adaptations nécessaires.\n\nIls documentent le processus de livraison définitif et le communiquent à toutes les parties prenantes impliquées. Ils élaborent en outre un concept de tests pour la livraison (p. ex. tests des fonctions et d’intégration) en considérant les éventuels risques de sécurité (p. ex. cycle de vie du matériel, sécurisation du transfert de données, concept de sécurité pour les éléments individuels).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "d2.1",
            "descr": "Ils identifient les processus de livraison existants, les interfaces et les parties prenantes concernées.",
            "bloom": "C4"
          },
          {
            "id": "d2.2",
            "descr": "Ils déterminent la plateforme appropriée, les extensions et adaptations nécessaires en fonction des exigences définies pour la solution. ",
            "bloom": "C4"
          },
          {
            "id": "d2.3",
            "descr": "Ils documentent l’entier du processus de livraison de façon claire et transparente.",
            "bloom": "C3"
          },
          {
            "id": "d2.4",
            "descr": "Ils présentent de façon claire et compréhensible le processus de livraison aux parties prenantes impliquées.",
            "bloom": "C3"
          },
          {
            "id": "d2.5",
            "descr": "Ils élaborent un concept de tests complet pour tester les fonctions et l’intégration de la livraison.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "122",
            "descr": "Automatiser des procédures à l’aide de scripts"
          },
          {
            "id": "158",
            "descr": "Planifier et exécuter la migration de logiciels"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          }
        ]
      },
      {
        "id": "d3",
        "title": "Compétence opérationnelle d3",
        "subject": "Préparer la plateforme d’exécution des solutions ICT",
        "description": "_Les informaticiennes et informaticiens préparent la plateforme d’exécution des solutions ICT:_\n\nIls mettent à disposition la plateforme d’exécution définitive (d2), (p. ex. chaîne continue d’outils de livraison [Continuous Delivery Toolchain], plateforme de virtualisation). Ce faisant, ils entretiennent des échanges étroits et proactifs avec les participants au projet concernés. Ils configurent en outre la plateforme conformément aux exigences planifiées. Ils documentent de façon compréhensible les étapes et configurations réalisées. Enfin, ils vérifient si la plateforme mise au point peut être acceptée.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "d3.1",
            "descr": "Ils mettent à disposition la plateforme d’exécution définitive.",
            "bloom": "C3"
          },
          {
            "id": "d3.2",
            "descr": "Ils configurent la plateforme d’exécution conformément aux exigences planifiées.",
            "bloom": "C3"
          },
          {
            "id": "d3.3",
            "descr": "Ils documentent de façon compréhensible la configuration de la plateforme d’exécution.",
            "bloom": "C3"
          },
          {
            "id": "d3.4",
            "descr": "Ils vérifient si la plateforme mise au point peut être acceptée conformément aux exigences définies.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "158",
            "descr": "Planifier et exécuter la migration de logiciels"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "d4",
        "title": "Compétence opérationnelle d4",
        "subject": "Mettre en service les solutions ICT",
        "description": "_Les informaticiennes et informaticiens mettent en service les solutions ICT conformément aux exigences définies. Ils s’assurent ainsi que la solution délivrée au mandant est optimale:_\n\nSelon le projet, ils demandent les autorisations et les droits d’accès requis pour la mise en service. Si nécessaire, ils coordonnent les adaptations à entreprendre sur les systèmes périphériques. Ils réalisent ensuite la mise en service (p. ex. exécution de scripts de déploiement, déploiement). Ils entretiennent des contacts réguliers avec les parties prenantes et les informent sur l’état d’avancement de la mise en service. Ils testent la solution selon le concept de tests (d2). Enfin, ils vérifient la solution quant aux risques de sécurité.\n\nIls remettent la solution ICT au mandant. Si nécessaire, ils dispensent une formation ou établissent une documentation (cf. a7).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "d4.1",
            "descr": "Ils demandent les autorisations et les droits d’accès requis pour la mise en service.",
            "bloom": "C3"
          },
          {
            "id": "d4.2",
            "descr": "Ils coordonnent les adaptations à entreprendre sur les systèmes périphériques.",
            "bloom": "C4"
          },
          {
            "id": "d4.3",
            "descr": "Ils exécutent les scripts de déploiement pour la mise en service.",
            "bloom": "C3"
          },
          {
            "id": "d4.4",
            "descr": "Ils effectuent le déploiement logiciel.",
            "bloom": "C3"
          },
          {
            "id": "d4.5",
            "descr": "Ils coordonnent le déploiement matériel avec les parties prenantes concernées.",
            "bloom": "C4"
          },
          {
            "id": "d4.6",
            "descr": "Ils informent régulièrement le mandant sur l’état d’avancement de la mise en service.",
            "bloom": "C3"
          },
          {
            "id": "d4.7",
            "descr": "Ils testent les fonctions et la sécurité de la solution ICT mise en service.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "122",
            "descr": "Automatiser des procédures à l’aide de scripts"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      }
    ]
  },
  {
    "id": "e",
    "title": "Domaine de compétences opérationnelles e",
    "subject": "Exploitation des réseaux",
    "competences": [
      {
        "id": "e1",
        "title": "Compétence opérationnelle e1",
        "subject": "Planifier et documenter les réseaux",
        "description": "_Les informaticiennes et informaticiens planifient de nouveaux réseaux IP pour les mandants les plus divers (de la micro-entreprise aux grandes sociétés), établissent les documentations nécessaires et en assurent le suivi. Ils fournissent ainsi des bases compréhensibles pour la mise en place et l’exploitation des réseaux:_\n\nIls recueillent tout d’abord les besoins (p. ex. disponibilité, sécurité) (a1) auprès des parties prenantes concernées (p. ex. mandant, division interne, fabricant). A partir des besoins recensés, ils élaborent une première proposition ou des variantes de solution. Selon la situation, ils tiennent compte des spécificités de l’entreprise, des standards/normes techniques et/ou des prescriptions légales. Ils consignent leur proposition.\n\nIls procèdent ensuite au design détaillé: ils conçoivent l’infrastructure réseau appropriée (LAN) en tenant compte des conditions spatiales et d’autres consignes (p. ex. bande passante, médias de transmission, sécurité et disponibilité de service requises). Ils documentent systématiquement la structure du réseau physique et logique et veillent à consigner toutes les indications pertinentes.\n\nIls évaluent par ailleurs les fournisseurs de services Internet (ISP) en fonction des besoins prédéfinis, ils en sélectionnent un et consignent dans le concept les données y relatives, variantes de coûts incluses.\n\nIls élaborent enfin un concept de tests en vue de vérifier le fonctionnement, la performance et la sécurité du réseau.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "e1.1",
            "descr": "Ils élaborent une proposition de solution pour un réseau à l’attention des parties prenantes en tenant compte des spécificités de l’entreprise, des standards techniques et des prescriptions légales.",
            "bloom": "C5"
          },
          {
            "id": "e1.2",
            "descr": "Ils évaluent la probabilité de panne du nouveau réseau et planifient, si nécessaire, des redondances.",
            "bloom": "C4"
          },
          {
            "id": "e1.3",
            "descr": "Ils conçoivent l’infrastructure réseau (LAN) en tenant compte des conditions spatiales et d’autres consignes.",
            "bloom": "C5"
          },
          {
            "id": "e1.4",
            "descr": "Ils conçoivent des mesures de sécurité physiques et systémiques dans le réseau local.",
            "bloom": "C5"
          },
          {
            "id": "e1.5",
            "descr": "Ils documentent de façon systématique et exhaustive la structure du réseau physique et logique.",
            "bloom": "C3"
          },
          {
            "id": "e1.6",
            "descr": "Ils sélectionnent un fournisseur de services Internet approprié (ISP) en fonction des besoins prédéfinis.",
            "bloom": "C4"
          },
          {
            "id": "e1.7",
            "descr": "Ils élaborent un concept de tests en vue de vérifier le fonctionnement, la performance et la sécurité du réseau.",
            "bloom": "C5"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "117",
            "descr": "Mettre en place l’infrastructure informatique et réseau d’une petite entreprise"
          },
          {
            "id": "129",
            "descr": "Mettre en service des composants réseaux"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "185",
            "descr": "Analyser et implémenter des mesures visant à assurer la sécurité informatique des PME (module optionnel)"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          },
          {
            "id": "184",
            "descr": "Implémenter la sécurité réseau (module optionnel)"
          }
        ]
      },
      {
        "id": "e2",
        "title": "Compétence opérationnelle e2",
        "subject": "Sélectionner et mettre en service les composants du réseau",
        "description": "_Sur la base de la planification du réseau réalisée sous (e1), les informaticiennes et informaticiens sélectionnent les composants du réseau appropriés et les mettent en service:_\n\nIls effectuent tout d’abord une recherche en vue de définir les composants du réseau appropriés. Ils établissent une liste de matériel complète selon le processus de commande interne et le budget alloué. A la réception de la commande, ils vérifient que l’intégralité des composants du réseau a bien été livrée.\n\nEn règle générale, ils établissent un concept de configuration. Puis, ils mettent les composants du réseau en service. Le plus souvent, ils installent tout d’abord en interne les composants du réseau et procèdent à des préconfigurations et à des mises à jour avant d’exécuter un premier contrôle du fonctionnement. Ils installent ensuite les composants du réseau chez le client. Ils effectuent une configuration finale et testent la capacité de fonctionnement du réseau selon le concept établi.\n\nSelon la situation, ils remettent le réseau installé au client, lui en expliquent le fonctionnement et, si nécessaire, lui dispensent une formation de base.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "e2.1",
            "descr": "Ils définissent les composants du réseau appropriés en tenant compte des besoins et du budget alloué.",
            "bloom": "C4"
          },
          {
            "id": "e2.2",
            "descr": "Ils établissent une liste de matériel complète selon le processus de commande interne.",
            "bloom": "C3"
          },
          {
            "id": "e2.3",
            "descr": "A la réception de la commande, ils vérifient que l’intégralité des composants du réseau a bien été livrée.",
            "bloom": "C4"
          },
          {
            "id": "e2.4",
            "descr": "Ils établissent un concept de configuration clair et compréhensible.",
            "bloom": "C5"
          },
          {
            "id": "e2.5",
            "descr": "Ils procèdent à des préconfigurations et à des mises à jour des composants du réseau.",
            "bloom": "C3"
          },
          {
            "id": "e2.6",
            "descr": "Ils installent les composants du réseau chez le client et effectuent la configuration finale.",
            "bloom": "C3"
          },
          {
            "id": "e2.7",
            "descr": "Ils testent la capacité de fonctionnement des composants du réseau installés.",
            "bloom": "C3"
          },
          {
            "id": "e2.8",
            "descr": "Ils expliquent en mots simples le fonctionnement du réseau au client.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "117",
            "descr": "Mettre en place l’infrastructure informatique et réseau d’une petite entreprise"
          },
          {
            "id": "129",
            "descr": "Mettre en service des composants réseaux"
          },
          {
            "id": "145",
            "descr": "Exploiter et étendre un réseau"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des ser-vices dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "e3",
        "title": "Compétence opérationnelle e3",
        "subject": "Maintenir et développer les réseaux",
        "description": "_Les informaticiennes et informaticiens maintiennent les réseaux dans le cadre de contrats de maintenance et, si nécessaire, poursuivent leur développement (amélioration continue des services):_\n\nDans les intervalles de maintenance définis, ils effectuent sur place des contrôles visuels des composants du réseau et décident si des mesures doivent être prises (p. ex. dépoussiérage). Ils contrôlent la journalisation des composants du réseau (p. ex. variations de température, taux de débit, taux de performance, charge du réseau, messages d’erreur). Si nécessaire, ils prennent des mesures pour développer le réseau à court ou à long terme (p. ex. composants supplémentaires, remaniement du réseau, adaptation de la configuration, correctifs et mises à jour).\n\nIls effectuent les mises à jour et les mises à niveau nécessaires ainsi que d’autres travaux de maintenance (p. ex. mise à jour du firmware). Ils documentent avec rigueur les travaux de maintenance effectués et leurs recommandations. Ils clarifient éventuellement avec leurs supérieurs hiérarchiques et leur mandant si des mesures plus importantes doivent être prises. Dans ce contexte, ils sont conscients du cycle de vie des différents composants du réseau et peuvent prévoir quand ceux-ci devront être remplacés. Ils tiennent également compte de critères écologiques, p. ex. labels énergétiques ou durabilité. Lors de tous les travaux de maintenance effectués, ils veillent à manipuler avec soin les appareils et prennent des mesures pour protéger ces derniers des décharges électrostatiques.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "e3.1",
            "descr": "Ils vérifient les composants du réseau par des contrôles visuels et définissent, si nécessaire, des mesures de maintenance.",
            "bloom": "C3"
          },
          {
            "id": "e3.2",
            "descr": "Ils contrôlent la journalisation (log) des différents composants du réseau.",
            "bloom": "C4"
          },
          {
            "id": "e3.3",
            "descr": "Ils prennent des mesures à court ou à long terme pour développer les composants du réseau.",
            "bloom": "C4"
          },
          {
            "id": "e3.4",
            "descr": "Ils effectuent les mises à jour et les mises à niveau des composants selon le concept d’exploitation établi et les instructions des fabricants.",
            "bloom": "C3"
          },
          {
            "id": "e3.5",
            "descr": "Ils documentent avec rigueur les travaux de maintenance effectués.",
            "bloom": "C3"
          },
          {
            "id": "e3.6",
            "descr": "Ils informent la partie prenante concernée du cycle de vie des appareils et des normes énergétiques et écologiques actuelles.",
            "bloom": "C3"
          },
          {
            "id": "e3.7",
            "descr": "Ils évaluent le moment où les appareils devront être remplacés.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "129",
            "descr": "Mettre en service des composants réseaux"
          },
          {
            "id": "145",
            "descr": "Exploiter et étendre un réseau"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "184",
            "descr": "Implémenter la sécurité réseau"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "e4",
        "title": "Compétence opérationnelle e4",
        "subject": "Implémenter, documenter et vérifier la sécurité des réseaux",
        "description": "_Les informaticiennes et informaticiens implémentent, documentent et vérifient la sécurité des réseaux. Ils garantissent ainsi que les systèmes critiques sont protégés de façon appropriée contre les attaques ou infections:\n\nIls analysent tout d’abord les risques potentiels en matière de sécurité du réseau et les évaluent. Pour ce faire, ils utilisent des outils actuels et spécifiques à l’exploitation (p. ex. scanneur de ports). Sur cette base, ils conçoivent les mesures de sécurité physiques et systémiques dans le réseau local (e1).\n\nIls mettent en œuvre les mesures de sécurité planifiées en implémentant des services et des composants sécuritaires (p. ex. pare-feu, VPN, NAT, VLAN, DMZ). Enfin, ils testent les mesures de sécurité de façon systématique et documentent leur fonctionnement.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "e4.1",
            "descr": "Ils analysent et évaluent les risques potentiels en matière de sécurité du réseau au moyen d’outils actuels et spécifiques à l’exploitation.",
            "bloom": "C4"
          },
          {
            "id": "e4.2",
            "descr": "Ils implémentent des outils et des composants sécuritaires.",
            "bloom": "C3"
          },
          {
            "id": "e4.3",
            "descr": "Ils testent les mesures de sécurité implémentées de façon systématique, selon le concept de tests.",
            "bloom": "C3"
          },
          {
            "id": "e4.4",
            "descr": "Ils documentent le fonctionnement des mesures de sécurité implémentées.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "117",
            "descr": "Mettre en place l’infrastructure informatique et réseau d’une petite entreprise"
          },
          {
            "id": "129",
            "descr": "Mettre en service des composants réseaux"
          },
          {
            "id": "145",
            "descr": "Exploiter et étendre un réseau"
          },
          {
            "id": "231",
            "descr": "Appliquer la protection et la sécurité des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "184",
            "descr": "Implémenter la sécurité réseau"
          },
          {
            "id": "185",
            "descr": "Analyser et implémenter des mesures visant à assurer la sécurité informatique des PME (module optionnel)"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "e5",
        "title": "Compétence opérationnelle e5",
        "subject": "Analyser, optimiser et documenter la performance d’un réseau",
        "description": "_Les informaticiennes et informaticiens analysent, optimisent et documentent la performance d’un réseau. Ces étapes se déroulent typiquement en cours de fonctionnement, par cycles réguliers, ou en cas de signalement de problèmes (p. ex. monitorage, messages des utilisateurs):_\n\nAprès la prise de contact et la description du problème (p. ex. le démarrage d’une application est lent) par une partie prenante, ils clarifient tout d’abord les causes possibles. Ils analysent la charge du réseau (LAN) et définissent ensuite des variantes de solution (p. ex. répartition de charge, qualité du service [QoS], PoE). Ce faisant, ils tiennent compte de divers facteurs, p. ex. les répercussions du câblage sur la performance. Ils documentent la solution choisie et adaptent la configuration des composants correspondants (p. ex. commutateur, routeur, point d’accès).\n\nIls testent le fonctionnement du réseau. Si nécessaire, ils proposent à la partie prenante un changement des composants ou une extension (→e1).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "e5.1",
            "descr": "Ils analysent les causes possibles de la capacité de performance limitée du réseau.",
            "bloom": "C4"
          },
          {
            "id": "e5.2",
            "descr": "Ils analysent la charge du réseau et définissent, en tenant compte des conséquences envisageables, des mesures d’optimisation appropriées.",
            "bloom": "C4"
          },
          {
            "id": "e5.3",
            "descr": "Ils documentent les mesures d’optimisation de façon claire et compréhensible.",
            "bloom": "C3"
          },
          {
            "id": "e5.4",
            "descr": "Ils adaptent la configuration des composants du réseau en fonction des mesures d’optimisation définies.",
            "bloom": "C3"
          },
          {
            "id": "e5.5",
            "descr": "Ils testent le fonctionnement du réseau.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "129",
            "descr": "Mettre en service des composants réseaux"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "e6",
        "title": "Compétence opérationnelle e6",
        "subject": "Surveiller les réseaux",
        "description": "_Les informaticiennes et informaticiens surveillent les réseaux en continu. Ils garantissent ainsi un fonctionnement ininterrompu du réseau et identifient à temps les problèmes, les dysfonctionnements et les possibilités d’amélioration:_\n\nA l’aide de divers outils de monitorage, ils surveillent les réseaux en continu, que ce soit pour leur entreprise ou des clients dans le cadre d’accords de niveau de service (SLA). Ils vérifient notamment la disponibilité et la capacité de fonctionnement des composants du réseau. Ils surveillent par ailleurs la charge du réseau (p. ex. performance des composants et des lignes de transmission). Ils évaluent le niveau d’urgence des messages/alertes entrants et prennent en temps voulu les mesures appropriées (trouble shooting). Ils circonscrivent l’erreur au niveau des composants. Ils procèdent de façon structurée et avec ténacité jusqu’à ce qu’ils identifient l’erreur. Enfin, ils organisent la procédure de suppression de l’erreur en équipe ou avec des partenaires externes.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "e6.1",
            "descr": "A l’aide des outils de monitorage donnés, ils surveillent les réseaux de façon continue et fiable.",
            "bloom": "C4"
          },
          {
            "id": "e6.2",
            "descr": "Ils vérifient la disponibilité et la capacité de fonctionnement des composants du réseau et la charge du réseau.",
            "bloom": "C4"
          },
          {
            "id": "e6.3",
            "descr": "Ils priorisent les messages et les alertes selon leur niveau d’urgence et définissent les mesures appropriées.",
            "bloom": "C4"
          },
          {
            "id": "e6.4",
            "descr": "Ils localisent et identifient les erreurs au niveau des composants du réseau en appliquant une procédure structurée.",
            "bloom": "C4"
          },
          {
            "id": "e6.5",
            "descr": "Ils organisent la procédure de suppression des erreurs en équipe ou avec des partenaires externes.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "129",
            "descr": "Mettre en service des composants réseaux"
          },
          {
            "id": "145",
            "descr": "Exploiter et étendre un réseau"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "184",
            "descr": "Implémenter la sécurité réseau"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      }
    ]
  },
  {
    "id": "f",
    "title": "Domaine de compétences opérationnelles f",
    "subject": "Exploitation des systèmes de serveurs et de leurs services",
    "competences": [
      {
        "id": "f1",
        "title": "Compétence opérationnelle f1",
        "subject": "Planifier et documenter les systèmes de serveurs et leurs services",
        "description": "_Les informaticiennes et informaticiens planifient et documentent les systèmes de serveurs et leurs services pour les mandants les plus divers (de la micro-entreprise aux grandes sociétés), établissent les documentations nécessaires et en assurent le suivi. Ils fournissent ainsi des bases compréhensibles pour la mise en place et l’exploitation des services:_\n\nIls recueillent tout d’abord auprès des parties prenantes concernées (p. ex. mandant, division interne, fabricant) les besoins en termes de fonctions requises et clarifient le budget prévu (→a1). A partir des besoins recensés, ils élaborent une première proposition ou des variantes de solution pour les systèmes de serveurs et/ou les services possibles (p. ex. services Web, bases de données, services de stockage des données, analytique des données). Selon la situation, ils tiennent compte des spécificités de l’entreprise, des normes/standards techniques et/ou des prescriptions légales ainsi que de la protection informatique de base. Ils conseillent les parties prenantes, clarifient leurs questions et soumettent leurs besoins à un examen critique. Ils consignent la variante de solution avec les besoins définis.\n\nDans une autre étape, ils déterminent la plateforme appropriée (p. ex. inhouse VM, cloud, système hybride, conteneur) et les paramètres de performance y relatifs (p. ex. OS, CPU, mémoire, stockage, réseau). A cet effet, ils utilisent des critères d’évaluation mesurables. Si nécessaire, ils sélectionnent le matériel et les logiciels appropriés. Dans ce contexte, ils adoptent une démarche prospective et tiennent compte des conditions cadres, p. ex. spécifications du fabricant, champ d’application, possibilités d’installation ou alimentation en électricité.\n\nIls définissent en outre les services et les ressources nécessaires (p. ex. ressources serveurs, services cloud, licences, autorisations, authentification unique [SSO]). Ce faisant, ils tiennent compte des dépendances déterminantes, p. ex. compatibilités du côté client (navigateur, chiffrement). Ils adoptent une perspective globale et envisagent les conséquences possibles.\n\nEnfin, ils établissent un concept de tests afin de vérifier, lors de la mise en service, le fonctionnement, la performance et la sécurité des systèmes et services.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f1.1",
            "descr": "Ils élaborent à l’attention des parties prenantes des propositions de solution pour les systèmes de serveurs et leurs services en tenant compte des spécificités de l’entreprise, des normes/standards techniques, des prescriptions légales ainsi que de la protection informatique de base.",
            "bloom": "C5"
          },
          {
            "id": "f1.2",
            "descr": "Ils clarifient de façon compréhensible les questions des parties prenantes au sujet des propositions de solutions et soumettent les besoins de celles-ci à un examen critique.",
            "bloom": "C3"
          },
          {
            "id": "f1.3",
            "descr": "Ils consignent les variantes de solution avec toutes les exigences.",
            "bloom": "C3"
          },
          {
            "id": "f1.4",
            "descr": " Ils déterminent les plateformes appropriées et les paramètres de performance en se fondant sur des critères d’évaluation mesurables",
            "bloom": "C4"
          },
          {
            "id": "f1.5",
            "descr": "Ils sélectionnent le matériel et les logiciels appropriés en adoptant une démarche prospective et en tenant compte des conditions cadres.",
            "bloom": "C4"
          },
          {
            "id": "f1.6",
            "descr": "Ils définissent les services appropriés avec les ressources nécessaires en tenant compte des dépendances déterminantes et des conséquences envisageables.",
            "bloom": "C4"
          },
          {
            "id": "f1.7",
            "descr": "Ils établissent un concept de tests afin de vérifier le fonctionnement, la performance ainsi que la sécurité des systèmes et services.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "123",
            "descr": "Mettre en œuvre les services d’un serveur"
          },
          {
            "id": "141",
            "descr": " Installer des systèmes de bases de données"
          },
          {
            "id": "143",
            "descr": "Implanter un système de sauvegarde et de restauration"
          },
          {
            "id": "157",
            "descr": "Planifier et exécuter l’introduction d’un système informatique"
          },
          {
            "id": "159",
            "descr": " Configurer et mettre en place les services d’annuaire"
          },
          {
            "id": "300",
            "descr": "Intégrer des services réseau multiplateformes"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "187",
            "descr": "Mettre en service un Poste detravail ICT avec le système d’exploitation"
          },
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          },
          {
            "id": "109",
            "descr": " Exploiter et surveiller des services dans le cloud public (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          }
        ]
      },
      {
        "id": "f2",
        "title": "Compétence opérationnelle f2",
        "subject": "Mettre en service les systèmes de serveurs",
        "description": "_Les informaticiennes et informaticiens mettent en service les systèmes de serveurs planifiés (par systèmes de serveurs, on entend le matériel, les machines virtuelles ou les conteneurs internes ou basés cloud):_\n\nUne fois que la décision de mise en œuvre du système de serveur est définitivement prise, ils se procurent les composants et/ou les ressources nécessaires (p. ex. personnel, matériel, infrastructure, licences, services cloud).\n\nIls mettent ensuite en service les composants et/ou les services en les installant et en les configurant conformément aux besoins. Pour ce faire, ils procèdent conformément à la planification établie et tiennent compte des exigences internes, des directives et meilleures pratiques. Ils vérifient le système de serveur en effectuant les tests planifiés (→f1) et transposent celui-ci dans l’environnement productif.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f2.1",
            "descr": "Ils se procurent les composants et les ressources choisis pour le système de serveur selon les processus de l’entreprise.",
            "bloom": "C3"
          },
          {
            "id": "f2.2",
            "descr": " Ils installent les composants et les services selon la planification établie, les exigences internes ainsi que les meilleures pratiques et les configurent.",
            "bloom": "C3"
          },
          {
            "id": "f2.3",
            "descr": "Ils vérifient le fonctionnement du système de serveur au moyen de tests appropriés.",
            "bloom": "C4"
          },
          {
            "id": "f2.4",
            "descr": "Ils transposent le système de serveur dans l’environnement productif.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "157",
            "descr": "Planifier et exécuter l’introduction d’un système informatique"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "187",
            "descr": "Mettre en service un Poste de travail ICT avec le système d’exploitation"
          },
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          }
        ]
      },
      {
        "id": "f3",
        "title": "Compétence opérationnelle f3",
        "subject": "Mettre en service les services du serveur",
        "description": "_Les informaticiennes et informaticiens mettent en service les services du serveur planifiés (qui peuvent p. ex. être un DNS, un serveur Web, une base de données, un JRE, une plateforme collaborative, une passerelle IoT, un bus de messagerie, l’analytique Big Data):_\n\n Une fois que la décision de mise en œuvre des services du serveur est définitivement prise, ils se procurent les ressources nécessaires (p. ex. personnel, licences, services cloud).\n\nDans une autre étape, ils mettent en service les services du serveur en les installant et en les configurant en fonction des besoins. Pour ce faire, ils procèdent conformément à la planification établie et tiennent compte des exigences internes, des directives et meilleures pratiques. Ils vérifient le service en effectuant les tests planifiés (→f1) et transposent celui-ci dans l’environnement productif. Enfin, ils mettent à jour le manuel d’utilisation et le transmettent au mandant.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f3.1",
            "descr": "Ils se procurent les ressources choisies pour le service du serveur selon les processus de l’entreprise.",
            "bloom": "C3"
          },
          {
            "id": "f3.2",
            "descr": "Ils installent et configurent le service du serveur conformément aux exigences, aux directives, aux prescriptions légales et aux meilleures pratiques.",
            "bloom": "C3"
          },
          {
            "id": "f3.3",
            "descr": "Ils vérifient le fonctionnement du service du serveur au moyen de tests appropriés.",
            "bloom": "C4"
          },
          {
            "id": "f3.4",
            "descr": "Ils transposent le service du serveur dans l’environnement productif.",
            "bloom": "C3"
          },
          {
            "id": "f3.5",
            "descr": "Ils mettent à jour le manuel d’utilisation et le transmettent au mandant.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "123",
            "descr": "Mettre en œuvre les services d’un serveur"
          },
          {
            "id": "141",
            "descr": "Installer des systèmes de bases de données"
          },
          {
            "id": "159",
            "descr": "Configurer et mettre en place les services d’annuaire"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          },
          {
            "id": "300",
            "descr": "Intégrer des services réseau multiplateformes"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          }
        ]
      },
      {
        "id": "f4",
        "title": "Compétence opérationnelle f4",
        "subject": "Maintenir et administrer les systèmes de serveurs et leurs services",
        "description": "_Les informaticiennes et informaticiens maintiennent et administrent les systèmes de serveurs et leurs services. Ils garantissent ainsi l’exploitation productive continue de ceux-ci:_\n\nSelon les besoins du système ou du service, ils définissent tout d’abord les tâches de maintenance et leur cycle (journalier, hebdomadaire, mensuel, en cas d’événements particuliers, selon les accords de niveau de service). Ils exécutent de manière fiable les tâches de maintenance aux intervalles définis et les documentent. Si des mises à jour sont requises (p. ex. mises à niveau, correctifs, firmware), ils les testent et les installent dans l’environnement productif.\n\nIls testent également le fonctionnement, la performance et la sécurité des systèmes et des services à intervalles réguliers. Si des modifications sont apportées aux systèmes, ils les documentent de façon claire. Ils adoptent une démarche rigoureuse et font en sorte que toute intervention sur les systèmes ou services soit en tout temps traçable et compréhensible. Ils respectent le secret professionnel et traitent les données avec précaution et en toute confidentialité.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f4.1",
            "descr": "Ils définissent les tâches de maintenance et leur cycle pour les systèmes de serveurs et leurs services.",
            "bloom": "C4"
          },
          {
            "id": "f4.2",
            "descr": "Ils exécutent les tâches de maintenance avec fiabilité et selon les consignes.",
            "bloom": "C3"
          },
          {
            "id": "f4.3",
            "descr": "Ils documentent de façon claire les tâches de maintenance exécutées.",
            "bloom": "C3"
          },
          {
            "id": "f4.4",
            "descr": "Ils testent les mises à jour et les installent dans l’environnement productif.",
            "bloom": "C3"
          },
          {
            "id": "f4.5",
            "descr": "Ils testent de façon systématique le fonctionnement, la performance et la sécurité des systèmes et des services.",
            "bloom": "C3"
          },
          {
            "id": "f4.6",
            "descr": "Ils documentent les interventions et les adaptations effectuées sur les systèmes et les services de façon compréhensible et respectent leur devoir de confidentialité.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "182",
            "descr": "Mettre en œuvre la sécurité système"
          },
          {
            "id": "159",
            "descr": "Configurer et mettre en place les services d’annuaire"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          },
          {
            "id": "300",
            "descr": "Intégrer des services réseau multiplateformes"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "187",
            "descr": "Mettre en service un Poste de travail ICT avec le système d’exploitation"
          },
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IOE (module optionnel)"
          }
        ]
      },
      {
        "id": "f5",
        "title": "Compétence opérationnelle f5",
        "subject": "Surveiller les systèmes de serveurs et leurs services",
        "description": "_Les informaticiennes et informaticiens surveillent les systèmes de serveurs et leurs services. Ils détectent ainsi les problèmes à temps et peuvent réduire les risques de panne:_\n\nIls définissent tout d’abord avec les parties prenantes concernées quels systèmes de serveurs et services doivent être surveillés. Ils déterminent ensuite les méthodes de surveillance appropriées (script, logiciel, messages, etc.). Ils fixent les valeurs limites et les actions à entreprendre en cas de non-atteinte ou de dépassement de ces valeurs. A cet égard, ils évaluent les risques respectifs en se fondant sur leurs expériences et selon les exigences du mandant ou les accords de niveau de service (SLA).\n\nUne fois que la surveillance est opérationnelle, ils vérifient à l’aide de tests périodiques si le système de surveillance fonctionne de manière fiable. Ils document les résultats de façon claire et compréhensible. En cas de messages d’erreur ou d’alertes, ils interviennent rapidement et engagent les mesures adéquates.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f5.1",
            "descr": "En concertation avec les parties prenantes, ils définissent les systèmes de serveurs et les services à surveiller.",
            "bloom": "C3"
          },
          {
            "id": "f5.2",
            "descr": "Ils déterminent les méthodes de surveillance appropriées.",
            "bloom": "C4"
          },
          {
            "id": "f5.3",
            "descr": "Ils définissent, en fonction de l’évaluation des risques, des valeurs limites sensées et les actions à entreprendre en cas de non-respect de ces valeurs.",
            "bloom": "C4"
          },
          {
            "id": "f5.4",
            "descr": "Ils vérifient à l’aide de tests périodiques le fonctionnement du système de surveillance et documentent les résultats",
            "bloom": "C4"
          },
          {
            "id": "f5.5",
            "descr": "En cas de messages d’erreur ou d’alertes, ils engagent rapidement les mesures adéquates.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "182",
            "descr": "Mettre en œuvre la sécurité système"
          },
          {
            "id": "123",
            "descr": "Mettre en œuvre les services d’un serveur"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "188",
            "descr": "Exploiter, surveiller et assurer la maintenance des services"
          },
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "f6",
        "title": "Compétence opérationnelle f6",
        "subject": "Implémenter, documenter et vérifier la sécurité des systèmes de serveurs et de leurs services",
        "description": "_Les informaticiennes et informaticiens implémentent, documentent et vérifient la sécurité des systèmes de serveurs et de leurs services:_\n\nDans un premier temps, ils élaborent un concept de sécurité conforme aux besoins des parties prenantes. Ce concept décrit les risques possibles et les systèmes/méthodes de sécurité appropriés pour garantir une protection informatique de base (p. ex. pare-feu, logiciels antivirus, autorisations, authentification unique [SSO]). Pour ce faire, ils travaillent en équipe et font appel, si nécessaire, à des partenaires. Ils appliquent les meilleures pratiques aux solutions utilisées.\n\nIls configurent les éléments de sécurité définis et testent leur efficacité. A intervalles réguliers, ils effectuent des tests de sécurité en cours de fonctionnement et documentent les résultats de manière compréhensible. Ils s’informent régulièrement des développements technologiques des systèmes de sécurité (p. ex. MELANI, CVE) et adaptent leurs concepts de sécurité en conséquence.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f6.1",
            "descr": "Ils élaborent en équipe un concept de sécurité pour les systèmes de serveurs et leurs services en appliquant les meilleures pratiques.",
            "bloom": "C5"
          },
          {
            "id": "f6.2",
            "descr": "Ils configurent de façon effective les éléments de sécurité.",
            "bloom": "C3"
          },
          {
            "id": "f6.3",
            "descr": "Ils testent à intervalles réguliers les systèmes de sécurité et documentent les résultats de façon compréhensible.",
            "bloom": "C4"
          },
          {
            "id": "f6.4",
            "descr": "Ils examinent les concepts de sécurité quant à leur actualité et, si nécessaire, les adaptent en fonction des développements technologiques.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "182",
            "descr": "Mettre en œuvre la sécurité système"
          },
          {
            "id": "141",
            "descr": "Installer des systèmes de bases de données"
          },
          {
            "id": "143",
            "descr": "Implanter un système de sauvegarde et de restauration"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          },
          {
            "id": "231",
            "descr": "Appliquer la protection et la sécurité des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "188",
            "descr": "Exploiter, surveiller et assurer la maintenance des services"
          },
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "f7",
        "title": "Compétence opérationnelle f7",
        "subject": "Planifier et mettre en œuvre la disponibilité des systèmes de serveurs et de leurs services",
        "description": "_Les informaticiennes et informaticiens planifient et mettent en œuvre la disponibilité des systèmes de serveurs et de leurs services. Ils appliquent les mesures adéquates pour prévenir la perte de données et respecter les temps d’interruption selon les directives:_\n\nLors d’entretiens avec les parties prenantes, ils déterminent tout d’abord la perte maximale de données admissible (Recovery Point Objective), la durée maximale d’interruption tolérable des systèmes de serveurs et de leurs services (Recovery Time Objective) ainsi que les durées de conservation des données (rétention des sauvegardes). Ils consignent les résultats dans une documentation.\n\nIls vérifient ensuite les systèmes et services actuels en regard de leur nature ou des accords de niveau de service (SLA) et relèvent les points où la disponibilité n’est pas encore assurée. Ils décident d’adaptations éventuelles et définissent les solutions/optimisations envisageables. Pour ce faire, leur capacité d’analyse et de conception est particulièrement sollicitée. Ils discutent des mesures d’optimisation avec les parties prenantes et demandent leur autorisation pour la mise en œuvre.\n\nIls concrétisent ensuite les solutions ou optimisations: ils procèdent aux adaptations planifiées sur l’environnement concerné. Ils testent à intervalles réguliers si la disponibilité des systèmes et des données respecte les exigences définies.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f7.1",
            "descr": "Lors d’entretiens avec les parties prenantes, ils déterminent la perte maximale de données admissible (RPO), la durée maximale d’interruption tolérable des systèmes de serveurs et de leurs services (RTO) ainsi que les durées de conservation des données et documentent leurs résultats.",
            "bloom": "C3"
          },
          {
            "id": "f7.2",
            "descr": "Ils vérifient si les systèmes et services actuels respectent les disponibilités définies.",
            "bloom": "C4"
          },
          {
            "id": "f7.3",
            "descr": "Ils conçoivent des solutions/mesures d’optimisation afin de garantir les disponibilités définies.",
            "bloom": "C5"
          },
          {
            "id": "f7.4",
            "descr": "Ils expliquent aux parties prenantes les solutions/mesures d’optimisation élaborées de manière compréhensible et claire en termes de rentabilité.",
            "bloom": "C3"
          },
          {
            "id": "f7.5",
            "descr": "Ils mettent en œuvre les solutions et/ou optimisations sur l’environnement concerné.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "141",
            "descr": "Installer des systèmes de bases de données"
          },
          {
            "id": "143",
            "descr": "Implanter un système de sauvegarde et de restauration"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      },
      {
        "id": "f8",
        "title": "Compétence opérationnelle f8",
        "subject": "Etablir et mettre en œuvre des concepts de sauvegarde et d’archivage des données",
        "description": "_Les informaticiennes et informaticiens établissent et mettent en œuvre des concepts de sauvegarde et d’archivage des données. Ils garantissent ainsi la disponibilité à long terme des données:_\n\nEn concertation avec les parties prenantes, ils définissent les données (p. ex données utilisateurs, de configuration, de système, de journalisation) à sauvegarder et à archiver. Ils établissent ensuite un concept de sauvegarde (concepts de reprise et de reprise après sinistre inclus) et/ou un concept d’archivage. Ce faisant, ils adoptent une démarche globale: ils tiennent compte du cycle de sauvegarde, des durées de conservation des données et des exigences de conformité. Ils définissent d’autres aspects déterminants tels que périodicité, taille, type de média, autorisations et accès. Ils respectent par ailleurs les prescriptions légales applicables à la protection des données (p. ex. RGPD).\n\nIls testent à intervalles réguliers si la restauration des données et des services s’effectue sans problèmes. Ils documentent les résultats des tests de façon compréhensible.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "f8.1",
            "descr": "En concertation avec les parties prenantes, ils définissent les données à sauvegarder ou à archiver.",
            "bloom": "C4"
          },
          {
            "id": "f8.2",
            "descr": "Ils établissent un concept complet de sauvegarde et d’archivage avec toutes les indications déterminantes et dans le respect des prescriptions légales.",
            "bloom": "C4"
          },
          {
            "id": "f8.3",
            "descr": "Ils établissent un concept complet de reprise après sinistre avec toutes les indications déterminantes et dans le respect des prescriptions légales.",
            "bloom": "C4"
          },
          {
            "id": "f8.4",
            "descr": "Ils testent à intervalles réguliers la restaurabilité des données et des services et documentent leurs résultats de façon compréhensible.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "143",
            "descr": "Implanter un système de sauvegarde et de restauration"
          },
          {
            "id": "169",
            "descr": "Mettre à disposition des services avec des conteneurs"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          },
          {
            "id": "231",
            "descr": "Appliquer la protection et la sécurité des données"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      }
    ]
  },
  {
    "id": "g",
    "title": "Domaine de compétences opérationnelles g",
    "subject": "Développement d’applications",
    "competences": [
      {
        "id": "g1",
        "title": "Compétence opérationnelle g1",
        "subject": "Analyser et documenter les besoins en matière d’applications et d’interfaces",
        "description": "_Les informaticiennes et informaticiens analysent les besoins identifiés lors de l’entretien avec le client (a1) et les documentent (ingénierie des exigences):_\n\nDans une première étape, ils consignent les besoins du client sous forme d’exigences techniques et spécifiques à son activité professionnelle. Afin de mieux cerner la perspective des utilisateurs, ils décrivent avec leur équipe et les parties prenantes concernées les groupes cibles et leurs besoins (p. ex. au moyen de personas). Cette phase peut être effectuée dans le cadre d’un workshop. Sur cette base, ils vérifient les exigences techniques devant être remplies par une application et les interfaces (p. ex. interface utilisateur [UI], REST, sensorique, périphérie) quant à leur cohérence, exhaustivité et mesurabilité (critères d’acceptation). Ils consignent les informations relatives aux conditions cadres, au contexte et à la délimitation ainsi que la définition des termes. Si nécessaire, ils complètent les exigences.\n\nDans une deuxième étape, ils dressent le catalogue des besoins, c.-à-d. qu’ils trient et regroupent ceux-ci selon des critères spécifiques à l’activité ou au projet (p. ex. besoins fonctionnels, non fonctionnels, qualité). Ils enregistrent les résultats dans le système (p. ex. backlog, issues, use cases, user stories) ou les consignent sur papier et leur attribuent une dénomination explicite (identification).\n\nDans une troisième étape, ils évaluent en équipe l’investissement en temps nécessaire, la complexité, le périmètre et la priorisation des lots de travail. Selon la situation, ils coordonnent la procédure avec le responsable de projet ou le propriétaire du produit. En concertation avec les parties prenantes, ils vérifient la validité des exigences définitives et s’assurent qu’il n’y ait pas de malentendus. En cas de changements au cours du développement applicatif, les exigences sont mises à jour (procédure itérative).",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "g1.1",
            "descr": "Ils consignent les besoins du client sous forme d’exigences techniques et spécifiques à son activité professionnelle.",
            "bloom": "C3"
          },
          {
            "id": "g1.2",
            "descr": "Ils développent en équipe des modèles utilisateur sur la base de personas.",
            "bloom": "C5"
          },
          {
            "id": "g1.3",
            "descr": "Ils vérifient les besoins techniques et spécifiques à l’activité professionnelle quant à leur cohérence, exhaustivité et mesurabilité.",
            "bloom": "C4"
          },
          {
            "id": "g1.4",
            "descr": "Ils dressent le catalogue des besoins selon des critères spécifiques à l’activité ou au projet et les consignent.",
            "bloom": "C4"
          },
          {
            "id": "g1.5",
            "descr": "Ils attribuent une dénomination explicite aux besoins.",
            "bloom": "C3"
          },
          {
            "id": "g1.6",
            "descr": "Ils évaluent en équipe l’investissement en temps, la complexité, le périmètre et la priorisation des lots de travail.",
            "bloom": "C4"
          },
          {
            "id": "g1.7",
            "descr": "Ils vérifient la validité des besoins avec les parties prenantes concernées.",
            "bloom": "C3"
          },
          {
            "id": "g1.8",
            "descr": "Ils documentent en continu les besoins techniques et spécifiques à l’activité professionnelle.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "322",
            "descr": "Concevoir et implémenter des interfaces utilisateur"
          },
          {
            "id": "254",
            "descr": "Décrire des processus métier dans son propre environnement professionnel"
          },
          {
            "id": "426",
            "descr": "Développer un logiciel avec des méthodes agiles"
          },
          {
            "id": "162",
            "descr": "Analyser et modéliser des données"
          },
          {
            "id": "164",
            "descr": "Créer des bases de données et y insérer des données"
          },
          {
            "id": "321",
            "descr": "Programmer des systèmes distribués"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          },
          {
            "id": "324",
            "descr": "Prendre en charge des processus DevOps avec des outils logiciels"
          }
        ]
      },
      {
        "id": "g2",
        "title": "Compétence opérationnelle g2",
        "subject": "Vérifier la faisabilité technique des prototypes d’interfaces utilisateur et les développer",
        "description": "_Les informaticiennes et informaticiens vérifient la faisabilité technique des prototypes d’interfaces utilisateur et les développent en termes de convivialité:_\n\nIls reçoivent du mandant ou d’autres partenaires des directives et consignes conceptuelles applicables aux interfaces utilisateur. Sur cette base, ils développent des maquettes ou des modèles d’interfaces fonctionnels (p. ex. mock-up, grid, wireframe) en utilisant des outils graphiques. Selon la situation, ils apportent des adaptations aux ébauches déjà élaborées.\n\nIls identifient ensuite les éléments problématiques de l’interface utilisateur, p. ex. les informations interdépendantes ou les composants non standards. Ils vérifient la faisabilité de ces éléments à l’aide de prototypes élaborés sur papier ou au moyen d’outils. Ce faisant, ils tiennent compte de différents aspects tels que l’étendue des informations, les dépendances entre les champs, les éléments d’interaction, la navigation, la réactivité, les règles d’or du design ou l’accessibilité. Ils discutent des éléments techniques non réalisables avec les parties prenantes. Ils leur proposent des solutions et adaptent le prototype en conséquence.\n\nSur la base du ou des prototypes, ils développent finalement les interfaces utilisateur fonctionnelles en utilisant des méthodes et des outils actuels.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "g2.1",
            "descr": "Ils développent des maquettes ou des modèles d’interfaces en utilisant des outils graphiques appropriés et en tenant compte des directives et des consignes conceptuelles.",
            "bloom": "C5"
          },
          {
            "id": "g2.2",
            "descr": "Ils identifient les éléments problématiques des interfaces utilisateur.",
            "bloom": "C4"
          },
          {
            "id": "g2.3",
            "descr": "Ils développent des prototypes des interfaces utilisateur.",
            "bloom": "C4"
          },
          {
            "id": "g2.4",
            "descr": "Ils vérifient la faisabilité des interfaces utilisateur en tenant compte des aspects déterminants.",
            "bloom": "C4"
          },
          {
            "id": "g2.5",
            "descr": "Ils discutent des modèles ou prototypes avec les parties prenantes et proposent des solutions alternatives pour les éléments non réalisables sur le plan technique.",
            "bloom": "C3"
          },
          {
            "id": "g2.6",
            "descr": "Ils développent des interfaces utilisateur fonctionnelles sur la base des prototypes.",
            "bloom": "C5"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "322",
            "descr": "Concevoir et implémenter des interfaces utilisateur"
          },
          {
            "id": "319",
            "descr": "Concevoir et implémenter des applications"
          },
          {
            "id": "320",
            "descr": "Programmer orienté objet"
          },
          {
            "id": "293",
            "descr": "Créer et publier un site Web"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "294",
            "descr": "Réaliser le front-end d’une application Web interactive"
          },
          {
            "id": "223",
            "descr": "Réaliser des applications multiutilisateurs orientées objets (module optionnel)"
          },
          {
            "id": "335",
            "descr": "Réaliser une application pour mobile (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          }
        ]
      },
      {
        "id": "g3",
        "title": "Compétence opérationnelle g3",
        "subject": "Evaluer et documenter la sécurité des applications et des interfaces",
        "description": "_Les informaticiennes et informaticiens évaluent la sécurité des applications et des interfaces et documentent leurs résultats:_\n\nIls clarifient tout d’abord les questions de sécurité relatives à l’environnement système, p. ex. quelles sont les interfaces existantes, qui sont les utilisateurs de l’application, quels autres systèmes accèdent à l’application, quel est le besoin de protection des données respectivement de l’application (disponibilité, confidentialité, fiabilité, intégrité), quelles directives internes ou prescriptions légales doivent être respectées.\n\nSur la base de leur examen, ils déduisent les risques auxquels peuvent être exposées l’application et ses interfaces. A cet égard, ils adoptent une démarche prospective et mettent en évidence les méthodes de menaces et les manipulations possibles provenant de l’extérieur. Ils discutent en équipe des résultats de leur analyse et en tirent les mesures appropriées qu’ils consignent (p. ex. encryptage des données, sécurité d’accès, gestion des identités, escaping). Enfin, ils adaptent le catalogue des exigences en fonction de leurs constats et en discutent avec la partie prenante.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "g3.1",
            "descr": "Ils clarifient les questions de sécurité relatives à l’environnement système de façon prospective et en déduisent les risques potentiels.",
            "bloom": "C4"
          },
          {
            "id": "g3.2",
            "descr": "Ils se procurent en équipe ou au sein de la communauté les informations pertinentes relatives à la sécurité (p. ex. OWASP).",
            "bloom": "C3"
          },
          {
            "id": "g3.3",
            "descr": "Ils consignent de façon compréhensible les risques de sécurité identifiés et les mesures en résultant.",
            "bloom": "C3"
          },
          {
            "id": "g3.4",
            "descr": "Ils expliquent au sein de leur équipe les mesures prises pour sécuriser les applications et les interfaces.",
            "bloom": "C3"
          },
          {
            "id": "g3.5",
            "descr": "Ils adaptent le catalogue des exigences en fonction de leurs constats et en discutent avec la partie prenante.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "183",
            "descr": "Implémenter la sécurité d’une application"
          },
          {
            "id": "114",
            "descr": "Mettre en œuvre des systèmes de codification, de compression et d’encryptage"
          },
          {
            "id": "450",
            "descr": "Tester des applications"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "295",
            "descr": "Réaliser le back-end pour des applications"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "207",
            "descr": "Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)"
          }
        ]
      },
      {
        "id": "g4",
        "title": "Compétence opérationnelle g4",
        "subject": "Elaborer des variantes de mise en œuvre d’une application et développer la solution sur le plan conceptuel",
        "description": "_Les informaticiennes et informaticiens élaborent des variantes de mise en œuvre d’une application et développent un concept de réalisation pour la variante choisie. Dans ce contexte, ils travaillent en étroite collaboration avec leur équipe et les parties prenantes:_\n\nA l’aide d’ébauches et de descriptions, ils présentent tout d’abord les variantes fondamentales en regard de leur implémentation (p. ex. technologies, composants, frameworks, librairies, systèmes). Conjointement avec les parties prenantes respectives, ils établissent une analyse d’utilité compréhensible des différentes variantes avec des critères décisionnels pertinents et évaluables. Sur la base de l’analyse d’utilité, ils conseillent la partie prenante dans sa prise de décision en vue de lui faire adopter la solution optimale. Ce faisant, ils veillent à ce que la solution soit défendable sur les plans éthique et légal. Enfin, ils vérifient la variante choisie, éventuellement sous la forme d’une analyse de faisabilité (→ a3).\n\nSur cette base, ils élaborent progressivement un concept de réalisation technique et spécialisé (p. ex. uses cases, composants, couches, déroulement, interfaces, classes, modèle de données). A cet effet, ils analysent les données, procédures, systèmes et interfaces pertinents et documentent leurs résultats. Ils utilisent pour ce faire des outils appropriés, p. ex. le langage de modélisation unifié (UML) ou d’autres diagrammes. Selon la situation, ils peuvent aussi concevoir des adaptations pour des applications existantes.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "g4.1",
            "descr": "Ils présentent, à l’aide d’ébauches et de descriptions, les variantes fondamentales en regard de leur implémentation.",
            "bloom": "C5"
          },
          {
            "id": "g4.2",
            "descr": "En collaboration avec les parties prenantes, ils établissent une analyse d’utilité compréhensible au moyen de critères décisionnels pertinents et évaluables.",
            "bloom": "C4"
          },
          {
            "id": "g4.3",
            "descr": "Ils conseillent la partie prenante dans sa prise de décision quant à la solution optimale, en tenant également compte des aspects éthiques et légaux.",
            "bloom": "C5"
          },
          {
            "id": "g4.4",
            "descr": "Ils élaborent un concept de réalisation technique et spécialisé au moyen des outils appropriés.",
            "bloom": "C5"
          },
          {
            "id": "g4.5",
            "descr": "Ils effectuent une analyse de faisabilité pour la variante choisie.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "319",
            "descr": "Concevoir et implémenter des applications"
          },
          {
            "id": "320",
            "descr": "Programmer orienté objet"
          },
          {
            "id": "323",
            "descr": "Programmer de manière fonctionnelle"
          },
          {
            "id": "164",
            "descr": "Créer des bases de données et y insérer des données"
          },
          {
            "id": "321",
            "descr": "Programmer des systèmes distribués"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          },
          {
            "id": "306",
            "descr": "Réaliser de petits projets dans son propre environnement professionnel"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "106",
            "descr": "Interroger, traiter et assurer la maintenance des bases de données"
          },
          {
            "id": "223",
            "descr": "Réaliser des applications multiutilisateurs orientées objets (module optionnel)"
          },
          {
            "id": "335",
            "descr": "Réaliser une application pour mobile (module optionnel)"
          },
          {
            "id": "259",
            "descr": "Développer des solutions ICT avec le Machine Learning (module optionnel)"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          },
          {
            "id": "107",
            "descr": "Mettre en œuvre des solutions ICT avec la technologie blockchain (module optionnel)"
          }
        ]
      },
      {
        "id": "g5",
        "title": "Compétence opérationnelle g5",
        "subject": "Implémenter les applications et les interfaces selon le concept en respectant les exigences de sécurité",
        "description": "_Sur la base des exigences définies et des ébauches/modèles développés, les informaticiennes et informaticiens implémentent les applications et les interfaces. Il peut s’agir de nouvelles applications ou d’une extension apportée à une application existante:_\n\nIls mettent tout d’abord en place un environnement de développement et d’exécution approprié. Le concept de réalisation préétabli et les directives de l’entreprise servent de base à cette étape.\n\nIls passent ensuite à la programmation du back-end et du front-end selon les exigences définies. A cet effet, ils utilisent les langages de programmation donnés et des outils de développement. Ils testent régulièrement l’implémentation en vue de détecter des erreurs et les corrigent (débogage). Ils veillent à respecter systématiquement les dispositions réglementaires et les directives techniques (p. ex. frameworks, directives de design). Ils se conforment également aux exigences de sécurité.\n\nLors de l’implémentation, ils veillent à respecter les conventions de code afin de garantir clarté et traçabilité (p. ex. clean code, coding conventions).\n\nIls déposent en continu les éléments programmés dans un système de gestion des logiciels (p. ex. GIT). Ils sont en mesure d’accéder en tout temps aux étapes intermédiaires enregistrées. Ce faisant, ils respectent les directives internes de l’entreprise (p. ex. divisions). Ils apportent ensuite d’éventuelles adaptations au concept de réalisation afin de le maintenir à jour.\n\nIls développent rapidement les technologies informatiques. Ils s’informent en continu sur les nouveautés et leurs conséquences (p. ex. quels sont les nouveaux frameworks?) et appliquent les derniers enseignements et avancées technologiques à leur travail quotidien.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "g5.1",
            "descr": "Ils mettent en place un environnement de développement et d’exécution approprié sur la base du concept de réalisation préétabli et des directives de l’entreprise.",
            "bloom": "C3"
          },
          {
            "id": "g5.2",
            "descr": "Ils programment de façon efficiente et structurée un back-end au moyen des langages de programmation prédéfinis et conformément aux consignes applicables en l’espèce.",
            "bloom": "C3"
          },
          {
            "id": "g5.3",
            "descr": "Ils programment de façon efficiente et structurée un front-end au moyen des langages de programmation prédéfinis et conformément aux consignes applicables en l’espèce.",
            "bloom": "C3"
          },
          {
            "id": "g5.4",
            "descr": "Ils vérifient les résultats intermédiaires au regard des exigences (fonctionnel, non fonctionnel, sécurité) et procèdent en continu à des corrections.",
            "bloom": "C4"
          },
          {
            "id": "g5.5",
            "descr": "Ils vérifient si les conventions de code sont bien respectées.",
            "bloom": "C3"
          },
          {
            "id": "g5.6",
            "descr": "Ils déposent les modifications et extensions de l’implémentation de façon claire et fiable dans un système de gestion des logiciels.",
            "bloom": "C3"
          },
          {
            "id": "g5.7",
            "descr": "Ils adaptent le concept de réalisation de façon claire et intelligible.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "319",
            "descr": "Concevoir et implémenter des applications"
          },
          {
            "id": "320",
            "descr": "Programmer orienté objet"
          },
          {
            "id": "323",
            "descr": "Programmer de manière fonctionnelle"
          },
          {
            "id": "293",
            "descr": "Créer et publier un site Web"
          },
          {
            "id": "165",
            "descr": "Utiliser des bases de données NoSQL"
          },
          {
            "id": "321",
            "descr": "Programmer des systèmes distribués"
          },
          {
            "id": "322",
            "descr": "Concevoir et implémenter des interfaces utilisateur"
          },
          {
            "id": "183",
            "descr": "Implémenter la sécurité d’une application"
          },
          {
            "id": "426",
            "descr": "Développer un logiciel avec des méthodes agiles"
          },
          {
            "id": "324",
            "descr": "Prendre en charge des processus DevOps avec des outils logiciels"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "106",
            "descr": " Interroger, traiter et assurer la maintenance des bases de données"
          },
          {
            "id": "294",
            "descr": "Réaliser le front-end d’une application Web interactive"
          },
          {
            "id": "295",
            "descr": "Réaliser le back-end pour des applications"
          },
          {
            "id": "223",
            "descr": "Réaliser des applications multiutilisateurs orientées objets (module optionnel)"
          },
          {
            "id": "335",
            "descr": "Réaliser une application pour mobile (module optionnel)"
          },
          {
            "id": "216",
            "descr": "Intégrer les terminaux IoE dans une plateforme existante (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel)"
          }
        ]
      },
      {
        "id": "g6",
        "title": "Compétence opérationnelle g6",
        "subject": "Vérifier la qualité et la sécurité des applications et des interfaces",
        "description": "_Les informaticiennes et informaticiens vérifient la qualité et la sécurité des applications et des interfaces sur la base de concepts de tests. Ils garantissent ainsi que les applications sont implémentées conformément aux exigences et les erreurs supprimées, et que l’application sera validée pour la mise en production:_\n\nIls établissent tout d’abord un concept de tests où ils décrivent l’environnement de tests de l’application avec les indications pertinentes (p. ex. système, acteur, données, utilisateurs, autorisations). Ils définissent ensuite les types de tests qui seront utilisés (p. ex. tests unitaires [unit tests], tests d’acceptation des utilisateurs, tests d’intégration, tests de charge/performance ou tests de sécurité.) Sur cette base, ils déterminent les moyens de test appropriés. Ils décrivent ensuite les cas de test (test cases) en relation avec les cas d’utilisation (use cases) et les exigences. Ce faisant, ils adoptent différents angles d’approche (p. ex. valeurs limites, situations d’erreurs). Ils s’assurent que les cas de test définis sont reproductibles (de manière automatisée ou manuelle). Ils définissent les résultats escomptés et les documentent de façon compréhensible.\n\nSi nécessaire, ils mettent en place un environnement de tests au cours d’une autre étape. Le concept de tests préalablement établi leur sert de base dans ce contexte. Ils implémentent, dans la mesure du possible, des cas de tests automatisables.\n\nIls exécutent ensuite tous les cas de test, évaluent le déroulement du test et consignent les résultats dans un rapport. Ils adoptent une démarche rigoureuse et établissent un rapport clair et compréhensible. En cas d’échec des cas de test, ils apportent des mesures correctives au test ou à l’implémentation. Les corrections apportées, ils effectuent de nouveaux tests.\n\nIls vérifient l’implémentation en fonction du concept de sécurité défini et, en cas d’écarts avec celui-ci, ils prennent des mesures appropriées en vue d’en respecter les différents points.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "g6.1",
            "descr": "Ils décrivent l’environnement de test d’une application avec toutes les indications pertinentes.",
            "bloom": "C3"
          },
          {
            "id": "g6.2",
            "descr": "Ils définissent les moyens de test sur la base des types de test sélectionnés.",
            "bloom": "C4"
          },
          {
            "id": "g6.3",
            "descr": "Ils décrivent de façon compréhensible des cas de test reproductibles en relation avec les cas d’utilisation et les exigences, et définissent les résultats escomptés.",
            "bloom": "C3"
          },
          {
            "id": "g6.4",
            "descr": "Ils mettent en place un environnement de test approprié selon le concept de tests.",
            "bloom": "C4"
          },
          {
            "id": "g6.5",
            "descr": "Ils implémentent les cas de test automatisables en fonction des moyens de test définis.",
            "bloom": "C4"
          },
          {
            "id": "g6.6",
            "descr": "Ils exécutent les cas de test intégralement et rigoureusement.",
            "bloom": "C3"
          },
          {
            "id": "g6.7",
            "descr": "Ils évaluent le déroulement du test et consignent les résultats de façon compréhensible dans un rapport.",
            "bloom": "C4"
          },
          {
            "id": "g6.8",
            "descr": "Ils définissent des mesures correctives et les exécutent.",
            "bloom": "C4"
          },
          {
            "id": "g6.9",
            "descr": "Ils vérifient l’implémentation en fonction du concept de sécurité défini et prennent les mesures correctives appropriées.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "183",
            "descr": "Implémenter la sécurité d’une application"
          },
          {
            "id": "426",
            "descr": "Développer un logiciel avec des méthodes agiles"
          },
          {
            "id": "450",
            "descr": "Tester des applications"
          },
          {
            "id": "324",
            "descr": "Prendre en charge des processus DevOps avec des outils logiciels"
          },
          {
            "id": "321",
            "descr": "Programmer des systèmes distribués"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "295",
            "descr": "Réaliser le back-end pour des applications"
          },
          {
            "id": "223",
            "descr": "Réaliser des applications multiutilisateurs orientées objets (module optionnel)"
          },
          {
            "id": "259",
            "descr": "Développer des solutions ICT avec le Machine Learning (module optionnel)"
          },
          {
            "id": "217",
            "descr": "Concevoir, planifier et mettre en place un service pour l’IoE (module optionnel) "
          }
        ]
      }
    ]
  },
  {
    "id": "h",
    "title": "Domaine de compétences opérationnelles h",
    "subject": "Délivrance et fonctionnement des applications",
    "competences": [
      {
        "id": "h1",
        "title": "Compétence opérationnelle h1",
        "subject": "Définir la plateforme appropriée pour la livraison des applications",
        "description": "_Les informaticiennes et informaticiens analysent les diverses exigences relatives au fonctionnement des applications et définissent la plateforme appropriée:_\n\nIls analysent tout d’abord les exigences prédéfinies et identifient les dépendances entre les composants (microservices, logiciels existants, applications/interfaces). Sur cette base, ils déterminent la plateforme appropriée au fonctionnement de l’application (cloud, sur site, client, hybride, multicloud).\n\nIls définissent ensuite le modèle de couches (SaaS, PaaS, IaaS) en fonction des conditions cadres de la partie prenante (p. ex. coûts, responsabilités, mise en œuvre). Ils identifient les exigences de sécurité (protection des données incluse) devant être remplies par la plateforme et choisissent les services appropriés.\n\nIls évaluent les ressources requises et les sélectionnent en fonction des recommandations de l’opérateur de la plateforme (performance, besoins en espace de stockage, disponibilité, coûts, accès). Ils veillent à trouver des solutions économiques et écologiques.\n\nIls vérifient ensuite la cohérence de leur choix en collaboration avec leur équipe et/ou la partie prenante, procèdent à d’éventuelles adaptations et consignent les résultats.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "h1.1",
            "descr": "Ils identifient les dépendances entre les divers composants.",
            "bloom": "C4"
          },
          {
            "id": "h1.2",
            "descr": "Ils déterminent la plateforme appropriée au fonctionnement de l’application.",
            "bloom": "C4"
          },
          {
            "id": "h1.3",
            "descr": "Ils définissent le modèle de couches en fonction des conditions cadres de la partie prenante.",
            "bloom": "C4"
          },
          {
            "id": "h1.4",
            "descr": "Ils identifient les exigences de sécurité devant être remplies par la plateforme et choisissent les services appropriés.",
            "bloom": "C4"
          },
          {
            "id": "h1.5",
            "descr": "Ils sélectionnent les ressources requises en fonction des recommandations de l’opérateur de la plateforme.",
            "bloom": "C3"
          },
          {
            "id": "h1.6",
            "descr": "Ils vérifient la cohérence de leur choix en collaboration avec leur équipe, procèdent à d’éventuelles adaptations et consignent les résultats.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          },
          {
            "id": "347",
            "descr": "Utiliser un service avec des conteneurs"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          }
        ]
      },
      {
        "id": "h2",
        "title": "Compétence opérationnelle h2",
        "subject": "Définir le processus de livraison des applications",
        "description": "_Les informaticiennes et informaticiens définissent le processus de livraison des applications ainsi que les techniques et outils à utiliser:_\n\nPour la définition du processus de livraison, ils se basent sur le modèle de procédure défini (p. ex. scrum).\n\nIls analysent tout d’abord les dépendances entre les différents composants en regard du processus de livraison. Ils intègrent également les migrations planifiables (Code First, schéma de base de données, de données) en tenant compte de l’architecture.\n\nIls déterminent les pratiques d’intégration appropriées (p. ex. Git flow, tronc, intégration continue) en fonction du type d’application et du modèle de procédure choisi et les consignent.\n\nIls définissent aussi les pratiques de déploiement adéquates (p. ex. déploiement continu, livraison continue) et les consignent.\n\nEnfin, ils déterminent la gestion des artefacts appropriée (p. ex. registre de conteneur) et la consignent.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "h2.1",
            "descr": "Ils analysent les dépendances entre les composants en regard du processus de livraison.",
            "bloom": "C4"
          },
          {
            "id": "h2.2",
            "descr": "Ils déterminent des pratiques d’intégration appropriées et les consignent.",
            "bloom": "C4"
          },
          {
            "id": "h2.3",
            "descr": "Ils définissent les pratiques de déploiement adéquates et les consignent.",
            "bloom": "C4"
          },
          {
            "id": "h2.4",
            "descr": "Ils déterminent la gestion des artefacts appropriée et la consignent.",
            "bloom": "C4"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "426",
            "descr": "Développer un logiciel avec des méthodes agiles"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          },
          {
            "id": "324",
            "descr": "Prendre en charge des processus DevOps avec des outils logiciels"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour de applications (module optionnel)"
          }
        ]
      },
      {
        "id": "h3",
        "title": "Compétence opérationnelle h3",
        "subject": "Implémenter le processus de livraison des applications",
        "description": "_Les informaticiennes et informaticiens implémentent le processus de livraison des applications selon la procédure définie:_\n\nSi cela n’a pas encore été fait, ils établissent une preuve de concept (proof of concept [PoC] pour la solution choisie (→ a3.5).\n\nIls implémentent ensuite le processus de livraison défini. Ils installent les services, écrivent les scripts d’automatisation et définissent les variables d’environnement en utilisant les méthodes et outils appropriés (p. ex. pipeline CI/CD, CLI, YAML).\n\nIls mettent à disposition les composants (environnement d’exécution/services) et empaquètent l’application (p. ex. docker, conteneur). Ils administrent et versionnent les artefacts.\n\nPour ce faire, ils adoptent une démarche structurée, contrôlent régulièrement leur travail en vue d’identifier des erreurs et, le cas échéant, les suppriment.\n\nEnfin, ils vérifient l’entier du processus de livraison de l’application selon la procédure applicable (p. ex. check-list) et testent la capacité de fonctionnement / l’interaction des applications au moyen d’un concept de tests (p. ex. test d’intégration).\n\nTout au long des différentes étapes, ils font preuve de ténacité et appliquent une procédure rigoureuse en vue d’améliorer et d’optimiser le processus de livraison.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "h3.1",
            "descr": "Ils installent les services de livraison.",
            "bloom": "C3"
          },
          {
            "id": "h3.2",
            "descr": "Ils écrivent les scripts d’automatisation et définissent les variables d’environnement au moyen des méthodes et des outils appropriés.",
            "bloom": "C3"
          },
          {
            "id": "h3.3",
            "descr": "Ils mettent à disposition les composants pour la livraison.",
            "bloom": "C3"
          },
          {
            "id": "h3.4",
            "descr": "Ils empaquètent l’application.",
            "bloom": "C3"
          },
          {
            "id": "h3.5",
            "descr": "Ils administrent et versionnent les artefacts.",
            "bloom": "C3"
          },
          {
            "id": "h3.6",
            "descr": "Ils vérifient le processus de livraison de l’application selon la procédure établie.",
            "bloom": "C3"
          },
          {
            "id": "h3.7",
            "descr": "Ils vérifient la capacité de fonctionnement/ l’interaction des applications au moyen d’un concept de tests.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "122",
            "descr": "Automatiser des procédures à l’aide de scripts"
          },
          {
            "id": "324",
            "descr": "Prendre en charge des processus DevOps avec des outils logiciels"
          },
          {
            "id": "347",
            "descr": "Utiliser un service avec des conteneurs"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "355",
            "descr": "Réaliser une application pour mobile (module optionnel)"
          },
          {
            "id": "190",
            "descr": "Mettre en place et exploiter une plateforme de virtualisation (module optionnel)"
          },
          {
            "id": "210",
            "descr": "Utiliser un cloud public pour des applications (module optionnel)"
          }
        ]
      },
      {
        "id": "h4",
        "title": "Compétence opérationnelle h4",
        "subject": "Surveiller les applications et les interfaces et résoudre les problèmes en cours de fonctionnement",
        "description": "_Les informaticiennes et informaticiens surveillent les applications et les interfaces, prennent des mesures en vue de maintenir la stabilité et résolvent, si nécessaire, les problèmes survenant en cours de fonctionnement:_\n\nPour la surveillance ou le monitorage d’une application, ils définissent tout d’abord tout ce qui doit être enregistré (métriques) et configurent les systèmes en conséquence (profondeur de journal [log depth], points de mesure). Ils intègrent dans l’application des mesures vue de détecter rapidement les utilisations abusives et les menaces.\n\nIls effectuent le monitorage à intervalles réguliers et vérifient l’état de l’application sur la base des informations enregistrées. Si nécessaire, ils procèdent à une analyse, p. ex. en cas de message d’erreur transmis par le client ou le système. Pour circonscrire le problème, ils reproduisent l’erreur. Ce faisant, ils adoptent une démarche analytique et font preuve de ténacité jusqu’à l’identification de l’erreur. Ils vérifient par ailleurs l’actualité et les paramètres de sécurité des applications et des interfaces. A cet effet, ils lisent régulièrement les communications des fabricants des frameworks et services utilisés.\n\nSur la base de l’analyse des erreurs, ils déterminent une procédure pour résoudre les problèmes et, selon les conséquences induites par celle-ci, ils en discutent en équipe ou avec la partie prenante concernée. Ce faisant, ils adoptent une démarche prospective et mettent en œuvre à temps les mesures définies (p. ex. cycle de vie du logiciel: planifier et installer les mises à jour/correctifs, renouvellement des certificats de sécurité, adaptations de la configuration). Ils consignent de façon claire et compréhensible les problèmes et mesures et complètent, si nécessaire, les cas de test.",
        "Objectifs évaluateurs entreprise": [
          {
            "id": "h4.1",
            "descr": "Ils définissent et configurent les outils pour le monitorage d’une application.",
            "bloom": "C3"
          },
          {
            "id": "h4.2",
            "descr": "Ils effectuent le monitorage à intervalles réguliers de façon fiable et rigoureuse.",
            "bloom": "C3"
          },
          {
            "id": "h4.3",
            "descr": "Ils analysent les problèmes en adoptant une procédure structurée.",
            "bloom": "C4"
          },
          {
            "id": "h4.4",
            "descr": "Ils vérifient l’actualité et les paramètres de sécurité des applications et des interfaces en consultant régulièrement les informations des fabricants.",
            "bloom": "C4"
          },
          {
            "id": "h4.5",
            "descr": "Ils définissent une procédure ciblée en vue de résoudre les problèmes et en discutent avec leur équipe et/ou la partie prenante concernée.",
            "bloom": "C5"
          },
          {
            "id": "h4.6",
            "descr": "Ils mettent en œuvre les mesures convenues et les consignent de façon claire et compréhensible.",
            "bloom": "C3"
          }
        ],
        "Modules école professionnelle": [
          {
            "id": "183",
            "descr": "Implémenter la sécurité d’une application"
          },
          {
            "id": "431",
            "descr": "Exécuter des mandats de manière autonome dans un environnement professionnel"
          },
          {
            "id": "321",
            "descr": "Programmer des systèmes distribués"
          },
          {
            "id": "346",
            "descr": "Concevoir et réaliser des solutions cloud"
          }
        ],
        "Modules cours interentreprises": [
          {
            "id": "187",
            "descr": "Mettre en service un Poste de travail ICT avec le système d’exploitation"
          },
          {
            "id": "110",
            "descr": "Analyser et représenter des données avec des outils (module optionnel)"
          },
          {
            "id": "109",
            "descr": "Exploiter et surveiller des services dans le cloud public (module optionnel)"
          }
        ]
      }
    ]
  }
]
